uTasker/uTasker-Kinetis/Hardware/STM32/STM32Sim.c
/**********************************************************************
    Mark Butcher    Bsc (Hons) MPhil MIET

    M.J.Butcher Consulting
    Birchstrasse 20f,    CH-5406, Rütihof
    Switzerland

    www.uTasker.com    Skype: M_J_Butcher

    ---------------------------------------------------------------------
    File:      STM32Sim.c
    Project:   Single Chip Embedded Internet
    ---------------------------------------------------------------------
    Copyright (C) M.J.Butcher Consulting 2004..2019
    *********************************************************************
    08.09.2012 Adapt RTC for F2/F4 devices                               {1}
    09.09.2012 Handle additional functions                               {2}
    12.09.2012 Add I2C 2 and 3 interrupts                                {3}
    11.06.2013 Add STM32F1xx USB ports                                   {4}
    26.09.2013 Add STM32F1xx RMII mode                                   {5}
    02.03.2014 Add CAN interface simulation                              {6}
    15.06.2014 Add F2/F4 memory to memory DMA                            {7}
    26.05.2015 Add hardware operating details to simulator status bar    {8}
    28.02.2017 Add UARTs 7 and 8                                         {9}
    02.02.2017 Adapt for us tick resolution
    06.09.2017 Add ADC simulation                                        {10}
    26.09.2018 Correct fnMapPortBit()                                    {11}

*/  


/* =================================================================== */
/*                           include files                             */
/* =================================================================== */
#if defined _STM32

#include "config.h"

#if defined CAN_INTERFACE && defined SIM_KOMODO
    #include "..\..\WinSim\Komodo\komodo.h" 
#endif


/**************************************************************************************************/
/*********************************  ST STM32  *****************************************************/
/**************************************************************************************************/


#define GET_PERIPHERALS 0
#define GET_OUTPUTS     1
#define GET_PER_TYPE    2
#define GET_OUTPUT_MASK 3
static unsigned short fnGetPortType(int portNr, int iRequest, int iStart);

static int iFlagRefresh = 0;

static unsigned long ulGPIOIN[11] = {0};                                 // the size is forced to largest port range
static unsigned long ulGPIOPER[PORTS_AVAILABLE] = {0};
static unsigned long ulGPIODDR[PORTS_AVAILABLE] = {0};
static unsigned long ulGPIODRIVE_VALUE[PORTS_AVAILABLE] = {0};

#if defined SUPPORT_ADC                                                  // {10}
    static unsigned short usADC_values[ADC_CHANNELS];
#endif

#if defined USB_INTERFACE
    static unsigned long ulEndpointInt = 0;
#endif
#if defined CAN_INTERFACE
    static unsigned short usCAN_time = 0;                                // CAN timestamp
#endif

unsigned long vector_ram[(sizeof(VECTOR_TABLE))/sizeof(unsigned long)];  // long word aligned

static unsigned char ucPortFunctions[PORTS_AVAILABLE][PORT_WIDTH] = {{0}};

// Initialisation for all non-zero registers in the device
//
static void fnSetDevice(unsigned short *port_inits)
{
    extern void fnEnterHW_table(void *hw_table);
#if defined SUPPORT_ADC
    int i;
#endif
    CPUID_BASE_REGISTER = 0x411fc231;
#if defined _STM32L0x1
    RCC_CR = (RCC_CR_MSIRDY | RCC_CR_MSION);                             // reset and clock control
    RCC_ICSCR = (RCC_ICSCR_MSIRANGE_2_097M);
#elif defined _STM32L432
    RCC_CR = (RCC_CR_MSIRANGE_4M | RCC_CR_MSIRDY | RCC_CR_MSION);        // reset and clock control
    RCC_CSR = (RCC_CSR_PINRSTF | RCC_CSR_PORRSTF | RCC_CSR_MSIRANGE_4M);
    RCC_APB1ENR1 = RCC_APB1ENR1_RTCAPBEN;
    RCC_APB1ENR1 = 0x00000400;
    RCC_AHB1SMENR = 0x00011303;
    RCC_AHB2SMENR = 0x0005229f;
    RCC_AHB3SMENR = 0x00000100;
    RCC_APB1SMENR1 = 0xf7e6ce31;
    RCC_APB1SMENR2 = 0x00000025;
    RCC_APB2SMENR = 0x00235c01;
    RCC_ICSCR = 0x106f0089;
    RCC_PLLCFGR = 0x00001000;
    RCC_PLLSAI1CFGR = 0x00001000;
#else
    RCC_CR = (0x00000080 | RCC_CR_HSIRDY | RCC_CR_HSION);                // reset and clock control
    RCC_CSR = (RCC_CSR_PINRSTF | RCC_CSR_PORRSTF);
#endif
    GPIOA_IDR = ulGPIOIN[0] = *port_inits++;                             // set port inputs to default states
    GPIOB_IDR = ulGPIOIN[1] = *port_inits++;
    GPIOC_IDR = ulGPIOIN[2] = *port_inits++;
    GPIOD_IDR = ulGPIOIN[3] = *port_inits++;
    GPIOE_IDR = ulGPIOIN[4] = *port_inits++;
    GPIOF_IDR = ulGPIOIN[5] = *port_inits++;
    GPIOG_IDR = ulGPIOIN[6] = *port_inits++;
#if defined _STM32F2XX || defined _STM32F4XX || defined _STM32F7XX || defined _STM32L432 || defined _STM32L4X5 || defined _STM32L4X6
    GPIOH_IDR = ulGPIOIN[7] = *port_inits++;
    GPIOI_IDR = ulGPIOIN[8] = *port_inits++;
    #if defined _STM32F7XX
    GPIOJ_IDR = ulGPIOIN[9]  = *port_inits++;
    GPIOK_IDR = ulGPIOIN[10] = *port_inits++;
    #endif

    #if defined _STM32F7XX
    PWR_CR = PWR_CR_VOS_1;
    #else
    PWR_CR = PWR_CR_VOS;
    #endif
    #if defined _STM32L4X5 || defined _STM32L4X6
    RCC_AHB1ENR = RCC_AHB1ENR_FLASHEN;
    RCC_PLLCFGR = 0x00001000;
    #elif !defined _STM32L432
    RCC_AHB1ENR = RCC_AHB1ENR_CCMDATARAMEN;
    RCC_PLLCFGR = 0x24003010;
    #endif
#elif defined _STM32L432 || defined _STM32L4X5 || defined _STM32L4X6
    RCC_AHB1ENR = (RCC_AHB1ENR_FLASHEN);
#elif defined _STM32L0x1
    RCC_AHBENR = RCC_AHBENR_MIFEN;
    RCC_IOPSMEN = 0x0000009f;
    RCC_AHBSMENR = 0x01001301;
    RCC_APB2SMENR = 0x00405225;
    RCC_APB1SMENR = 0xd07e4833;
    RCC_CSR = 0x0c000000;
#else
    RCC_AHB1ENR = (RCC_AHB1ENR_FLITFEN | RCC_AHB1ENR_SRAMEN);
#endif
#if defined _STM32L0x1
    FLASH_PECR = 0x0000007;
    FLASH_SR = 0x0000000c;
    FLASH_OPTR = 0x807000aa;
#else
    FLASH_CR = FLASH_CR_LOCK;                                            // FLASH controller
    #if defined _STM32F2XX || defined _STM32F4XX || defined _STM32F7XX
    FLASH_OPTCR = DEFAULT_FLASH_OPTION_SETTING;
        #if defined FLASH_OPTCR1
    FLASH_OPTCR1 = DEFAULT_FLASH_OPTION_SETTING_1;
        #endif
    #else
    FLASH_WRPR = 0xffffffff;
    FLASH_OBR = 0x03fffffc;
    #endif
#endif
#if defined _STM32L0x1
    GPIOA_MODER = 0xebfffcff;
    GPIOA_PUPDR = 0x24000000;
    GPIOB_MODER = 0xffffffff;
    GPIOC_MODER = 0xffffffff;
    GPIOD_MODER = 0xffffffff;
    GPIOE_MODER = 0xffffffff;
    GPIOH_MODER = 0xffffffff;
#elif defined _STM32F2XX || defined _STM32F4XX || defined _STM32F7XX || defined _STM32L432 || defined _STM32F031 || defined _STM32L4X5 || defined _STM32L4X6
    GPIOA_MODER = 0xa8000000;
    GPIOB_MODER = 0x00000280;
    GPIOB_OSPEEDR = 0x000000c0;
    GPIOA_PUPDR = 0x64000000;
    GPIOB_PUPDR = 0x00000100;
#else
    GPIOA_CRL = 0x44444444;                                              // port input states
    GPIOA_CRH = 0x44444444;
    GPIOB_CRL = 0x44444444;
    GPIOB_CRH = 0x44444444;
    GPIOC_CRL = 0x44444444;
    GPIOC_CRH = 0x44444444;
    GPIOD_CRL = 0x44444444;
    GPIOD_CRH = 0x44444444;
    GPIOE_CRL = 0x44444444;
    GPIOE_CRH = 0x44444444;
    GPIOF_CRL = 0x44444444;
    GPIOF_CRH = 0x44444444;
    GPIOG_CRL = 0x44444444;
    GPIOG_CRH = 0x44444444;
#endif

