uTasker/uTasker-Kinetis/Hardware/STM32/STM32Sim.c
#if defined _STM32F7XX || defined _STM32L432 || defined _STM32L0x1 || defined _STM32F031 || defined _STM32L4X5 || defined _STM32L4X6
    USART1_ISR = (0x02000000 | USART_ISR_TXE | USART_ISR_TC);
    USART2_ISR = (0x02000000 | USART_ISR_TXE | USART_ISR_TC);
    #if USARTS_AVAILABLE > 2
    USART3_ISR = (0x02000000 | USART_ISR_TXE | USART_ISR_TC);
    #endif
    #if UARTS_AVAILABLE > 0
    UART4_ISR = (0x02000000 | USART_ISR_TXE | USART_ISR_TC);
    #endif
    #if UARTS_AVAILABLE > 1
    UART5_ISR = (0x02000000 | USART_ISR_TXE | USART_ISR_TC);
    #endif
    #if USARTS_AVAILABLE > 3
    USART6_ISR = (0x02000000 | USART_ISR_TXE | USART_ISR_TC);
    #endif
    #if UARTS_AVAILABLE > 2
    UART7_ISR = (0x02000000 | USART_ISR_TXE | USART_ISR_TC);
    #endif
    #if UARTS_AVAILABLE > 3
    UART8_ISR = (0x02000000 | USART_ISR_TXE | USART_ISR_TC);
    #endif
    #if LPUARTS_AVAILABLE > 0
    LPUART1_ISR = (USART_ISR_TXE | USART_ISR_TC);
    #endif
#else
    USART1_SR = 0x00c0;                                                  // USARTs and UARTs
    USART2_SR = 0x00c0;
    #if USARTS_AVAILABLE > 2 && !defined USART3_NOT_PRESENT
    USART3_SR = 0x00c0;
    #endif
    #if UARTS_AVAILABLE > 0
    UART4_SR  = 0x00c0;
    #endif
    #if UARTS_AVAILABLE > 1
    UART5_SR  = 0x00c0;
    #endif
    #if defined _STM32F2XX || defined _STM32F4XX
    USART6_SR = 0x00c0;
    #endif
    #if CHIP_HAS_UARTS > 6
    UART7_SR = (USART_SR_TC | USART_SR_TXE);
    #endif
    #if CHIP_HAS_UARTS > 7
    UART8_SR = (USART_SR_TC | USART_SR_TXE);
    #endif
#endif

    SPI1_CRCPR = 7;                                                      // SPI (I2S)
    SPI2_I2SPR = 0x00000002;
    SPI2_CRCPR = 7;
    SPI3_I2SPR = 0x00000002;
    SPI3_CRCPR = 7;

    ETH_MACA0HR = 0x8000ffff;                                            // Ethernet
    ETH_MACA0LR = 0xffffffff;
    ETH_MACA1HR = 0x0000ffff;
    ETH_MACA1LR = 0xffffffff;
    ETH_MACA2HR = 0x0000ffff;
    ETH_MACA2LR = 0xffffffff;
    ETH_MACA3HR = 0x0000ffff;
    ETH_MACA3LR = 0xffffffff;
    ETH_DMABMR  = 0x00002101;
    ETH_MACCR   = 0x00008000;

    IWDG_RLR = 0xfff;                                                    // independent watchdog
#if defined _STM32L432 || defined _STM32L0x1
    IWDG_WINR = 0xfff;
#endif
#if defined USB_DEVICE_AVAILABLE                                         // USB FS device
    USB_CNTR = (USB_CNTR_PDWN | USB_CNTR_FRES);
#endif
#if defined USB_OTG_AVAILABLE                                            // USB OTG FS
    OTG_FS_GOTGCTL  = OTG_FS_GOTGCTL_DHNPEN;
    OTG_FS_GUSBCFG  = 0x00000a00;
    OTG_FS_GRSTCTL  = 0x20000000;
    OTG_FS_DCFG     = 0x02200000;
    OTG_FS_GRXFSIZ  = 0x00000200;
    OTG_FS_DIEPTXF0 = 0x00000200;
    OTG_FS_DIEPTXF1 = OTG_FS_DIEPTXF2 = OTG_FS_DIEPTXF3 = 0x02000400;
    OTG_FS_DOEPINT0 = OTG_FS_DOEPINT1 = OTG_FS_DOEPINT2 = OTG_FS_DOEPINT3 = 0x00000080;
    OTG_FS_DIEPINT0 = OTG_FS_DIEPINT1 = OTG_FS_DIEPINT2 = OTG_FS_DIEPINT3 = OTG_FS_DIEPINT_TXFE;
    OTG_FS_DSTS     = 0x00000010;
    OTG_FS_DOEPCTL0 = OTG_FS_DOEPCTL_USBAEP;

    FSMC_BCR1  = (FSMC_BCR_WAITEN | FSMC_BCR_WREN | FSMC_BCR_FACCEN | FSMC_BCR_MWD_16 | FSMC_BCR_MTYP_NOR_FLASH); // FSMC
    FSMC_BCR2  = (FSMC_BCR_WAITEN | FSMC_BCR_WREN | FSMC_BCR_FACCEN | FSMC_BCR_MWD_16 | FSMC_BCR_MTYP_SRAM_ROM);
    FSMC_BCR3  = (FSMC_BCR_WAITEN | FSMC_BCR_WREN | FSMC_BCR_FACCEN | FSMC_BCR_MWD_16 | FSMC_BCR_MTYP_SRAM_ROM);
    FSMC_BCR4  = (FSMC_BCR_WAITEN | FSMC_BCR_WREN | FSMC_BCR_FACCEN | FSMC_BCR_MWD_16 | FSMC_BCR_MTYP_SRAM_ROM);

    FSMC_BTR1  = 0x0fffffff;
    FSMC_BTR2  = 0x0fffffff;
    FSMC_BTR3  = 0x0fffffff;
    FSMC_BTR4  = 0x0fffffff;
    FSMC_BWTR1 = 0x0fffffff;
    FSMC_BWTR2 = 0x0fffffff;
    FSMC_BWTR3 = 0x0fffffff;
    FSMC_BWTR4 = 0x0fffffff;
#endif


    ADC1_HTR = 0x00000fff;                                               // ADC
    ADC2_HTR = 0x00000fff;
    ADC3_HTR = 0x00000fff;

    CAN1_MCR   = (CAN_MCR_DBF | CAN_MCR_SLEEP);                          // bxCAN
    CAN1_MSR   = (CAN_MSR_RX | CAN_MSR_SAMP | CAN_MSR_SLAK);
    CAN1_TSR   = (0x1c000000);
    CAN1_BTR   = (0x00230000);
    CAN1_FMR   = (CAN_FMR_FINIT | 0x2a1ce00);

    CAN2_MCR   = (CAN_MCR_DBF | CAN_MCR_SLEEP);
    CAN2_MSR   = (0x00000c02);
    CAN2_TSR   = (0x1c000000);
    CAN2_BTR   = (0x00230000);
    CAN2_FMR   = (CAN_FMR_FINIT | 0x2a1ce00);

#if defined SUPPORT_ADC                                                  // {10}
    for (i = 0; i < (ADC_CHANNELS); i++) {
        usADC_values[i] = (unsigned short)*port_inits++;                 // {2} prime initial ADC values
    }
#endif
    fnEnterHW_table(ucPortFunctions);
}


static unsigned char ucFLASH[SIZE_OF_FLASH];                             // copy of FLASH memory


extern void fnInitialiseDevice(void *port_inits)
{
    uMemset(ucFLASH, 0xff, sizeof(ucFLASH));                             // we start with deleted FLASH memory contents
    fnPrimeFileSystem();                                                 // the project can then set parameters or files as required
    fnSetDevice((unsigned short *)port_inits);                           // set device registers to startup condition (if not zerod)
}

extern void fnDeleteFlashSector(unsigned char *ptrSector)
{
	int i = FLASH_GRANULARITY;

	while (i-- != 0) {
		*ptrSector++ = 0xff;
	}
}



// Transform physical access address to address in simulated FLASH
//
extern unsigned char *fnGetFlashAdd(unsigned char *ucAdd)               
{
    unsigned char *ucSimulatedFlash = ucAdd + (unsigned long)ucFLASH - (unsigned long)FLASH_START_ADDRESS;
    if (ucSimulatedFlash >= &ucFLASH[SIZE_OF_FLASH]) {                   // check flash bounds
        _EXCEPTION("Attempted access outside of internal Flash bounds!!!");
    }
    return (ucSimulatedFlash);                                           // location in simulated internal FLASH memory
}

// Transform simulated address in simulated FLASH back to physical address in real FLASH
//
extern unsigned char *fnPutFlashAdd(unsigned char *ucAdd) 
{
    unsigned long sim_add = (unsigned long)ucFLASH - (unsigned long)FLASH_START_ADDRESS;
    return (ucAdd - sim_add);
}



extern unsigned char *fnGetFileSystemStart(int iMemory)
{
    #if defined SPI_FILE_SYSTEM && !defined FLASH_FILE_SYSTEM
    return (fnGetEEPROM(uFILE_START));                                   // EEPROM
    #else
    return (ucFLASH);                                                    // internal FLASH
    #endif
}

extern unsigned long fnGetFlashSize(int iMemory)
{
    return SIZE_OF_FLASH;                                                // size fo internal flash
}


/******************************************************************************************************/



// A copy of the STM32 peripheral registers for simulation purposes
//
extern STM32M_PERIPH  STM32 = {0};


