uTasker/uTasker-Kinetis/Hardware/STM32/STM32Sim.c
// Check whether a particular interrupt is enabled in the NVIC
//
static int fnGenInt(int iIrqID)
{
    if (iIrqID < 32) {
        IRQ0_31_SPR |= (1 << iIrqID);
        IRQ0_31_CPR = IRQ0_31_SPR;
        if ((IRQ0_31_SER & (1 << iIrqID)) != 0) {                        // if interrupt is not disabled
            return 1;
        }
    }
    else if (iIrqID < 64) {
        IRQ32_63_SPR |= (1 << (iIrqID - 32));
        IRQ32_63_CPR = IRQ32_63_SPR;
        if ((IRQ32_63_SER & (1 << (iIrqID - 32))) != 0) {                // if interrupt is not disabled
            return 1;
        }
    }
    else if (iIrqID < 96) {
        IRQ64_95_SPR |= (1 << (iIrqID - 64));
        IRQ64_95_CPR = IRQ64_95_SPR;
        if ((IRQ64_95_SER & (1 << (iIrqID - 64))) != 0) {                // if interrupt is not disabled
            return 1;
        }
    }
    else if (iIrqID < 128) {
        IRQ96_127_SPR |= (1 << (iIrqID - 96));
        IRQ96_127_CPR = IRQ96_127_SPR;
        if ((IRQ96_127_SER & (1 << (iIrqID - 96))) != 0) {               // if interrupt is not disabled
            return 1;
        }
    }
    else if (iIrqID < 160) {
        IRQ128_159_SPR |= (1 << (iIrqID - 128));
        IRQ128_159_CPR = IRQ128_159_SPR;
        if ((IRQ128_159_SER & (1 << (iIrqID - 128))) != 0) {             // if interrupt is not disabled
            return 1;
        }
    }
    else if (iIrqID < 192) {
        IRQ160_191_SPR |= (1 << (iIrqID - 164));
        IRQ160_191_CPR = IRQ160_191_SPR;
        if ((IRQ160_191_SER & (1 << (iIrqID - 164))) != 0) {             // if interrupt is not disabled
            return 1;
        }
    }
    return 0;
}


// Process simulated interrupts
//
extern unsigned long fnSimInts(char *argv[])
{
    unsigned long ulNewActions = 0;
    VECTOR_TABLE *ptrVect = (VECTOR_TABLE *)VECTOR_TABLE_OFFSET_REG;
    int *ptrCnt;

	if (((iInts & CHANNEL_0_SERIAL_INT) != 0) && (argv != 0)) {
        ptrCnt = (int *)argv[THROUGHPUT_UART0];
        if (*ptrCnt != 0) {
            if (--(*ptrCnt) == 0) {
                iMasks |= CHANNEL_0_SERIAL_INT;                          // enough serial interupts handled in this tick period
            }
            else {
#if defined SERIAL_INTERFACE
		        iInts &= ~CHANNEL_0_SERIAL_INT;                          // interrupt has been handled
                fnLogTx0((unsigned char)USART1_TDR);
                ulNewActions |= SEND_COM_0;
    #if defined _STM32F7XX || defined _STM32L432 || defined _STM32L0x1 || defined _STM32F031 || defined _STM32L4X5 || defined _STM32L4X6
                USART1_ISR |= USART_ISR_TXE;
    #else
                USART1_SR |= USART_SR_TXE;
    #endif
                if ((USART1_CR1 & USART_CR1_TXEIE) != 0) {               // if tx interrupts enabled
                    if (fnGenInt(irq_USART1_ID) != 0) {                  // if USART 1 interrupt is not disabled
                        ptrVect->processor_interrupts.irq_USART1();      // call the interrupt handler
                    }
                }
#endif
            }
        }
	}

	if (((iInts & CHANNEL_1_SERIAL_INT) != 0) && (argv != 0)) {
        ptrCnt = (int *)argv[THROUGHPUT_UART1];
        if (*ptrCnt != 0) {
            if (--(*ptrCnt) == 0) {
                iMasks |= CHANNEL_1_SERIAL_INT;                          // enough serial interupts handled in this tick period
            }
            else {
#if defined SERIAL_INTERFACE
		        iInts &= ~CHANNEL_1_SERIAL_INT;                          // interrupt has been handled
                fnLogTx1((unsigned char)USART2_TDR);
                ulNewActions |= SEND_COM_1;
    #if defined _STM32F7XX || defined _STM32L432 || defined _STM32L0x1 || defined _STM32F031 || defined _STM32L4X5 || defined _STM32L4X6
                USART2_ISR |= USART_ISR_TXE;
    #else
                USART2_SR |= USART_SR_TXE;
    #endif
                if ((USART2_CR1 & USART_CR1_TXEIE) != 0) {               // if tx interrupts enabled
                    if (fnGenInt(irq_USART2_ID) != 0) {                  // if USART 2 interrupt is not disabled
                        ptrVect->processor_interrupts.irq_USART2();      // call the interrupt handler
                    }
                }
#endif
            }
        }
	}
#if USARTS_AVAILABLE > 2 && !defined USART3_NOT_PRESENT
	if (((iInts & CHANNEL_2_SERIAL_INT) != 0) && (argv != 0)) {
        ptrCnt = (int *)argv[THROUGHPUT_UART2];
        if (*ptrCnt != 0) {
            if (--(*ptrCnt) == 0) {
                iMasks |= CHANNEL_2_SERIAL_INT;                          // enough serial interupts handled in this tick period
            }
            else {
    #if defined SERIAL_INTERFACE
		        iInts &= ~CHANNEL_2_SERIAL_INT;                          // interrupt has been handled
                fnLogTx2((unsigned char)USART3_TDR);
                ulNewActions |= SEND_COM_2;
        #if defined _STM32F7XX || defined _STM32L432 || defined _STM32L0x1 || defined _STM32L4X5 || defined _STM32L4X6
                USART3_ISR |= USART_ISR_TXE;
        #else
                USART3_SR |= USART_SR_TXE;
        #endif
                if ((USART3_CR1 & USART_CR1_TXEIE) != 0) {               // if tx interrupts enabled
                    if ((IRQ32_63_SER & (1 << (irq_USART3_ID - 32))) != 0) { // if USART 3 interrupt is not disabled
                        ptrVect->processor_interrupts.irq_USART3();      // call the interrupt handler
                    }
                }
    #endif
            }
        }
	}
#endif
#if UARTS_AVAILABLE > 0
	if (((iInts & CHANNEL_3_SERIAL_INT) != 0) && (argv != 0)) {
        ptrCnt = (int *)argv[THROUGHPUT_UART3];
        if (*ptrCnt != 0) {
            if (--(*ptrCnt) == 0) {
                iMasks |= CHANNEL_3_SERIAL_INT;                          // enough serial interupts handled in this tick period
            }
            else {
    #if defined SERIAL_INTERFACE
		        iInts &= ~CHANNEL_3_SERIAL_INT;                          // interrupt has been handled
                fnLogTx3((unsigned char)UART4_TDR);
                ulNewActions |= SEND_COM_3;
        #if defined _STM32F7XX || defined _STM32L432 || defined _STM32L0x1 || defined _STM32L4X5 || defined _STM32L4X6
                UART4_ISR |= USART_ISR_TXE;
        #else
                UART4_SR |= USART_SR_TXE;
        #endif
                if ((UART4_CR1 & USART_CR1_TXEIE) != 0) {                // if tx interrupts enabled
                    if ((IRQ32_63_SER & (1 << (irq_UART4_ID - 32))) != 0) { // if UART 4 interrupt is not disabled
                        ptrVect->processor_interrupts.irq_UART4();       // call the interrupt handler
                    }
                }
    #endif
            }
        }
	}
#endif
#if UARTS_AVAILABLE > 1
	if (((iInts & CHANNEL_4_SERIAL_INT) != 0) && (argv != 0)) {
        ptrCnt = (int *)argv[THROUGHPUT_UART4];
        if (*ptrCnt != 0) {
            if (--(*ptrCnt) == 0) {
                iMasks |= CHANNEL_4_SERIAL_INT;                          // enough serial interupts handled in this tick period
            }
            else {
    #if defined SERIAL_INTERFACE
		        iInts &= ~CHANNEL_4_SERIAL_INT;                          // interrupt has been handled
                fnLogTx4((unsigned char)UART5_TDR);
                ulNewActions |= SEND_COM_4;
        #if defined _STM32F7XX || defined _STM32L432 || defined _STM32L0x1 || defined _STM32L4X5 || defined _STM32L4X6
                UART5_ISR |= USART_ISR_TXE;
        #else
                UART5_SR |= USART_SR_TXE;
        #endif
                if ((UART5_CR1 & USART_CR1_TXEIE) != 0) {                // if tx interrupts enabled
                    if ((IRQ32_63_SER & (1 << (irq_UART5_ID - 32))) != 0) { // if UART 5 interrupt is not disabled
                        ptrVect->processor_interrupts.irq_UART5();       // call the interrupt handler
                    }
                }
    #endif
            }
        }
	}
#endif
#if defined _STM32F2XX || defined _STM32F4XX || defined _STM32F7XX || defined _STM32L4X5 || defined _STM32L4X6
	if ((iInts & CHANNEL_5_SERIAL_INT) && (argv)) {
        ptrCnt = (int *)argv[THROUGHPUT_UART5];
        if (*ptrCnt) {
            if (--(*ptrCnt) == 0) {
                iMasks |= CHANNEL_5_SERIAL_INT;                          // enough serial interupts handled in this tick period
            }
            else {
    #if defined SERIAL_INTERFACE
		        iInts &= ~CHANNEL_5_SERIAL_INT;                          // interrupt has been handled
        #if defined _STM32L4X5 || defined _STM32L4X6
                fnLogTx5((unsigned char)LPUART1_TDR);
        #else
                fnLogTx5((unsigned char)USART6_TDR);
        #endif
                ulNewActions |= SEND_COM_5;
        #if defined _STM32F7XX
                USART6_ISR |= USART_ISR_TXE;
        #elif defined _STM32L4X5 || defined _STM32L4X6
                LPUART1_ISR |= USART_ISR_TXE;
        #else
                USART6_SR |= USART_SR_TXE;
        #endif
        #if defined _STM32L4X5 || defined _STM32L4X6
                if (LPUART1_CR1 & USART_CR1_TXEIE) {                     // if tx interrupts enabled
                    if (IRQ64_95_SER & (1 << (irq_LPUART1_ID - 64))) {   // if LPUART1 interrupt is not disabled
                        ptrVect->processor_interrupts.irq_LPUART1();     // call the interrupt handler
                    }
                }
        #else
                if (USART6_CR1 & USART_CR1_TXEIE) {                      // if tx interrupts enabled
                    if (IRQ64_95_SER & (1 << (irq_USART6_ID - 64))) {    // if USART 6 interrupt is not disabled
                        ptrVect->processor_interrupts.irq_USART6();      // call the interrupt handler
                    }
                }
        #endif
    #endif
            }
        }
	}
#endif

#if defined _STM32F7XX || defined _STM32F429 || defined _STM32F427       // {9}
	if (((iInts & CHANNEL_6_SERIAL_INT) != 0) && (argv != 0)) {
        ptrCnt = (int *)argv[THROUGHPUT_UART6];
        if (*ptrCnt != 0) {
            if (--(*ptrCnt) == 0) {
                iMasks |= CHANNEL_6_SERIAL_INT;                          // enough serial interupts handled in this tick period
            }
            else {
    #if defined SERIAL_INTERFACE
		        iInts &= ~CHANNEL_6_SERIAL_INT;                          // interrupt has been handled
                fnLogTx6((unsigned char)UART7_TDR);
                ulNewActions |= SEND_COM_6;
        #if defined _STM32F7XX
                UART7_ISR |= USART_ISR_TXE;
        #else
                UART7_SR |= USART_SR_TXE;
        #endif
                if ((UART7_CR1 & USART_CR1_TXEIE) != 0) {                // if tx interrupts enabled
                    if (IRQ64_95_SER & (1 << (irq_UART7_ID - 64))) {     // if UART 7 interrupt is not disabled
                        ptrVect->processor_interrupts.irq_UART7();       // call the interrupt handler
                    }
                }
    #endif
            }
        }
	}
	if (((iInts & CHANNEL_7_SERIAL_INT) != 0) && (argv != 0)) {
        ptrCnt = (int *)argv[THROUGHPUT_UART7];
        if (*ptrCnt != 0) {
            if (--(*ptrCnt) == 0) {
                iMasks |= CHANNEL_7_SERIAL_INT;                          // enough serial interupts handled in this tick period
            }
            else {
    #if defined SERIAL_INTERFACE
		        iInts &= ~CHANNEL_7_SERIAL_INT;                          // interrupt has been handled
                fnLogTx7((unsigned char)UART8_TDR);
                ulNewActions |= SEND_COM_7;
        #if defined _STM32F7XX
                UART8_ISR |= USART_ISR_TXE;
        #else
                UART8_SR |= USART_SR_TXE;
        #endif
                if ((UART8_CR1 & USART_CR1_TXEIE) != 0) {                // if tx interrupts enabled
                    if (IRQ64_95_SER & (1 << (irq_UART8_ID - 64))) {     // if UART 8 interrupt is not disabled
                        ptrVect->processor_interrupts.irq_UART8();       // call the interrupt handler
                    }
                }
    #endif
            }
        }
	}
#endif

    if ((iInts & I2C_INT0) != 0) {
        ptrCnt = (int *)argv[THROUGHPUT_I2C0];
        if (*ptrCnt) {
            if (--(*ptrCnt) == 0) {
                iMasks |= I2C_INT0;                                      // enough I2C interupts handled in this tick period
            }
            else {
#if defined I2C_INTERFACE
		        iInts &= ~I2C_INT0;
                if ((I2C1_CR2 & (I2C_CR2_ITBUFEN)) != 0) {               // if tx interrupts enabled
                    if (IRQ0_31_SER & (1 << irq_I2C1_EV_ID)) {           // if I2C1 interrupt is not disabled
                        ptrVect->processor_interrupts.irq_I2C1_EV();     // call the interrupt handler
                    }
                }
#endif
            }
        }
    }
    if (iInts & I2C_INT1) {                                              // {3}
        ptrCnt = (int *)argv[THROUGHPUT_I2C1];
        if (*ptrCnt) {
            if (--(*ptrCnt) == 0) {
                iMasks |= I2C_INT1;                                      // enough I2C interupts handled in this tick period
            }
            else {
#if defined I2C_INTERFACE
		        iInts &= ~I2C_INT1;
                if ((I2C2_CR2 & (I2C_CR2_ITBUFEN)) != 0) {               // if tx interrupts enabled
                    if (IRQ32_63_SER & (1 << (irq_I2C2_EV_ID - 32))) {   // if I2C2 interrupt is not disabled
                        ptrVect->processor_interrupts.irq_I2C2_EV();     // call the interrupt handler
                    }
                }
#endif
            }
        }
    }
#if CHIP_HAS_I2C > 2                                                     // {3}
    if (iInts & I2C_INT2) {
        ptrCnt = (int *)argv[THROUGHPUT_I2C2];
        if (*ptrCnt) {
            if (--(*ptrCnt) == 0) {
                iMasks |= I2C_INT2;                                      // enough I2C interupts handled in this tick period
            }
            else {
#if defined I2C_INTERFACE
		        iInts &= ~I2C_INT2;
                I2C3_SR1 |= I2C_SR1_TxE;                                 // transmitter buffer empty
                I2C3_SR1 &= ~(I2C_SR1_BTF);                              // transfer not yet complete
                if ((I2C3_CR2 & (I2C_CR2_ITBUFEN)) != 0) {               // if tx interrupts enabled
                    if (IRQ64_95_SER & (1 << (irq_I2C3_EV_ID - 64))) {   // if I2C3 interrupt is not disabled
                        ptrVect->processor_interrupts.irq_I2C3_EV();     // call the interrupt handler
                    }
                }
                if ((iInts & I2C_INT2) == 0) {
                    I2C3_SR1 |= (I2C_SR1_BTF | I2C_SR1_SB);              // transfer complete or start complete
                    if ((I2C3_CR2 & (I2C_CR2_ITEVTEN)) != 0) {           // if event interrupts enabled
                        if (IRQ64_95_SER & (1 << (irq_I2C3_EV_ID - 64))) { // if I2C3 interrupt is not disabled
                            ptrVect->processor_interrupts.irq_I2C3_EV(); // call the interrupt handler
                        }
                    }
                }
#endif
            }
        }
    }
#endif
#if defined USB_INTERFACE && defined USB_DEVICE_AVAILABLE
    if (iInts & USB_INT) {
        int iEndpoint = 0;
        iInts &= ~USB_INT;
        while ((iEndpoint < NUMBER_OF_USB_ENDPOINTS) && (ulEndpointInt != 0)) {
            if (ulEndpointInt & (1 << iEndpoint)) {
                ulEndpointInt &= ~(1 << iEndpoint);
                fnCheckUSBOut(0, iEndpoint);
            }
            iEndpoint++;
        }
    }
#endif
    return ulNewActions;
}

