uTasker/uTasker-Kinetis/Hardware/STM32/STM32Sim.c
// Process simulated DMA
//
extern unsigned long fnSimDMA(char *argv[])
{
#if defined DMA_MEMCPY_SET
    if (argv == 0) {                                                     // memory to memory transfer
    #if (defined _STM32F2XX || defined _STM32F4XX || defined _STM32F7XX) // {7} memory to memory transfers are only suppoirted on DMA2
        if ((DMA2_S1CR & DMA_SxCR_EN) != 0) {                            // if enabled
            unsigned short usLength = (unsigned short)DMA2_S1NDTR;       // the transfer length
            unsigned char *ptrDestination = (unsigned char *)DMA2_S1M0AR;
            unsigned char *ptrSource = (unsigned char *)DMA2_S1PAR;
            if ((DMA2_S1CR & (DMA_SxCR_DIR_M2M | DMA_SxCR_DIR_M2P)) != (DMA_SxCR_DIR_M2M)) {
                _EXCEPTION("DMA configuration doesn't seem to be correct!!");
            }
            switch (DMA2_S1CR & (DMA_SxCR_PSIZE_32 | DMA_SxCR_PSIZE_16)) {
            case DMA_SxCR_PSIZE_8:
                if ((DMA2_S1CR & (DMA_SxCR_MSIZE_32 | DMA_SxCR_MSIZE_16)) != DMA_SxCR_MSIZE_8) {
                    _EXCEPTION("Source and destination sizes are not equal!!");
                }
                while (usLength-- != 0) {
                    *ptrDestination = *ptrSource;
                    if ((DMA2_S1CR & DMA_SxCR_MINC) != 0) {
                        ptrDestination++;
                    }
                    if ((DMA2_S1CR & DMA_SxCR_PINC) != 0) {
                        ptrSource++;
                    }
                }
                break;
            case DMA_SxCR_PSIZE_16:
                if ((DMA2_S1CR & (DMA_SxCR_MSIZE_32 | DMA_SxCR_MSIZE_16)) != DMA_SxCR_MSIZE_16) {
                    _EXCEPTION("Source and destination sizes are not equal!!");
                }
                while (usLength-- != 0) {
                    *(unsigned short *)ptrDestination = *(unsigned short *)ptrSource;
                    if ((DMA2_S1CR & DMA_SxCR_MINC) != 0) {
                        ptrDestination += sizeof(unsigned short);
                    }
                    if ((DMA2_S1CR & DMA_SxCR_PINC) != 0) {
                        ptrSource += sizeof(unsigned short);
                    }
                }
                break;
            case DMA_SxCR_PSIZE_32:
                if ((DMA2_S1CR & (DMA_SxCR_MSIZE_32 | DMA_SxCR_MSIZE_16)) != DMA_SxCR_MSIZE_32) {
                    _EXCEPTION("Source and destination sizes are not equal!!");
                }
                while (usLength-- != 0) {
                    *(unsigned long *)ptrDestination = *(unsigned long *)ptrSource;
                    if ((DMA2_S1CR & DMA_SxCR_MINC) != 0) {
                        ptrDestination += sizeof(unsigned long);
                    }
                    if ((DMA2_S1CR & DMA_SxCR_PINC) != 0) {
                        ptrSource += sizeof(unsigned long);
                    }
                }
                break;
            }
            DMA2_S1NDTR = 0;
            DMA2_LISR = (DMA_LISR_TCIF1 | DMA_LISR_HTIF1);
            DMA2_S1CR &= ~(DMA_SxCR_EN);
        }
    #else        
        if (DMA_CCR_MEMCPY & DMA1_CCR1_EN) {                             // if enabled
            unsigned short usLength = (unsigned short)DMA_CNDTR_MEMCPY;  // the transfer length
            unsigned char *ptrSource = (unsigned char *)DMA_CMAR_MEMCPY;
            unsigned char *ptrDestination = (unsigned char *)DMA_CPAR_MEMCPY;
            if ((DMA_CCR_MEMCPY & (DMA1_CCR1_MEM2MEM | DMA1_CCR1_DIR)) != (DMA1_CCR1_MEM2MEM | DMA1_CCR1_DIR)) {
                _EXCEPTION("DMA configuration doesn't seem to be correct!!");
            }

            while (usLength-- != 0) {
                *ptrDestination = *ptrSource;
                if (DMA_CCR_MEMCPY & DMA1_CCR1_PINC) {
                    ptrDestination++;
                }
                if (DMA_CCR_MEMCPY & DMA1_CCR1_MINC) {
                    ptrSource++;
                }
            }
            DMA_CNDTR_MEMCPY = 0;
        #if MEMCPY_CHANNEL > 7
            DMA2_ISR |= (DMA1_ISR_TCIF1 << ((MEMCPY_CHANNEL - 8) * 4));
        #else
            DMA1_ISR |= (DMA1_ISR_TCIF1 << ((MEMCPY_CHANNEL - 1) * 4));
        #endif
        }
    #endif
        return 0;
    }
#endif
    return 0;
}

// Periodic tick - dummy since the timer is now handled by timer simulator
//
extern void RealTimeInterrupt(void)
{
}

#if defined I2C_INTERFACE
extern void fnSimulateI2C(int iPort, unsigned char *ptrDebugIn, unsigned short usLen, int iRepeatedStart)
{
    _EXCEPTION("To do!!!");
}
#endif

// Simulate the reception of serial data by inserting bytes into the input buffer and calling interrupts
//
extern void fnSimulateSerialIn(int iPort, unsigned char *ptrDebugIn, unsigned short usLen)
{
#if defined SERIAL_INTERFACE
    VECTOR_TABLE *ptrVect = (VECTOR_TABLE *)VECTOR_TABLE_OFFSET_REG;
    switch (iPort) {
    case 0:                                                              // USART 1
	    while (usLen-- != 0) {
    #if defined _STM32F7XX || defined _STM32L432 || defined _STM32L0x1 || defined _STM32F031 || defined _STM32L4X5 || defined _STM32L4X6
		    USART1_RDR = *ptrDebugIn++;                                  // put received byte to input buffer
            USART1_ISR |= USART_ISR_RXNE;
    #else
		    USART1_DR = *ptrDebugIn++;                                   // put received byte to input buffer
            USART1_SR |= USART_SR_RXNE;
    #endif
            if ((USART1_CR1 & USART_CR1_RXNEIE) != 0) {                  // if rx interrupts enabled
                if (fnGenInt(irq_USART1_ID) != 0) {                      // if USART 1 interrupt is not disabled
                    ptrVect->processor_interrupts.irq_USART1();          // call the interrupt handler (note that UART0 is refered to as USART1 at the STM32)
                }
            }
	    }
        break;
    #if USARTS_AVAILABLE > 2
    case 1:                                                              // USART 2
	    while (usLen-- != 0) {
        #if defined _STM32F7XX || defined _STM32L432 || defined _STM32L0x1 || defined _STM32F031 || defined _STM32L4X5 || defined _STM32L4X6
		    USART2_RDR = *ptrDebugIn++;                                  // put received byte to input buffer
            USART2_ISR |= USART_ISR_RXNE;
        #else
		    USART2_DR = *ptrDebugIn++;                                   // put received byte to input buffer
            USART2_SR |= USART_SR_RXNE;
        #endif
            if ((USART2_CR1 & USART_CR1_RXNEIE) != 0) {                  // if rx interrupts enabled
                if (fnGenInt(irq_USART2_ID) != 0) {                      // if USART 2 interrupt is not disabled
                    ptrVect->processor_interrupts.irq_USART2();          // call the interrupt handler
                }
            }
	    }
        break;
    #endif
    #if USARTS_AVAILABLE > 2 && !defined USART3_NOT_PRESENT
    case 2:                                                              // USART 3
	    while (usLen-- != 0) {
        #if defined _STM32F7XX || defined _STM32L432 || defined _STM32L0x1 || defined _STM32L4X5 || defined _STM32L4X6
		    USART3_RDR = *ptrDebugIn++;                                  // put received byte to input buffer
            USART3_ISR |= USART_ISR_RXNE;
        #else
		    USART3_DR = *ptrDebugIn++;                                   // put received byte to input buffer
            USART3_SR |= USART_SR_RXNE;
        #endif
            if ((USART3_CR1 & USART_CR1_RXNEIE) != 0) {                  // if rx interrupts enabled
                if ((IRQ32_63_SER & (1 << (irq_USART3_ID - 32))) != 0) { // if USART 3 interrupt is not disabled
                    ptrVect->processor_interrupts.irq_USART3();          // call the interrupt handler
                }
            }
	    }
        break;
    #endif
    #if UARTS_AVAILABLE > 0
    case 3:                                                              // UART 4
	    while (usLen-- != 0) {
        #if defined _STM32F7XX || defined _STM32L4X5 || defined _STM32L4X6
		    UART4_RDR = *ptrDebugIn++;                                   // put received byte to input buffer
            UART4_ISR |= USART_ISR_RXNE;
        #else
		    UART4_DR = *ptrDebugIn++;                                    // put received byte to input buffer
            UART4_SR |= USART_SR_RXNE;
        #endif
            if ((UART4_CR1 & USART_CR1_RXNEIE) != 0) {                   // if rx interrupts enabled
                if ((IRQ32_63_SER & (1 << (irq_UART4_ID - 32))) != 0) {  // if UART 4 interrupt is not disabled
                    ptrVect->processor_interrupts.irq_UART4();           // call the interrupt handler
                }
            }
	    }
        break;
    #endif
    #if UARTS_AVAILABLE > 1
    case 4:                                                              // UART 5
	    while (usLen-- != 0) {
        #if defined _STM32F7XX || defined _STM32L4X5 || defined _STM32L4X6
		    UART5_RDR = *ptrDebugIn++;                                   // put received byte to input buffer
            UART5_ISR |= USART_ISR_RXNE;
        #else
		    UART5_DR = *ptrDebugIn++;                                    // put received byte to input buffer
            UART5_SR |= USART_SR_RXNE;
        #endif
            if ((UART5_CR1 & USART_CR1_RXNEIE) != 0) {                   // if rx interrupts enabled
                if ((IRQ32_63_SER & (1 << (irq_UART5_ID - 32))) != 0) {  // if UART 5 interrupt is not disabled
                    ptrVect->processor_interrupts.irq_UART5();           // call the interrupt handler
                }
            }
	    }
        break;
    #endif
    #if defined _STM32F2XX || defined _STM32F4XX || defined _STM32F7XX
    case 5:                                                              // USART 6
	    while (usLen-- != 0) {
        #if defined _STM32F7XX
		    USART6_RDR = *ptrDebugIn++;                                  // put received byte to input buffer
            USART6_ISR |= USART_ISR_RXNE;
        #else
		    USART6_DR = *ptrDebugIn++;                                   // put received byte to input buffer
            USART6_SR |= USART_SR_RXNE;
        #endif
            if (USART6_CR1 & USART_CR1_RXNEIE) {                         // if rx interrupts enabled
                if (IRQ64_95_SER & (1 << (irq_USART6_ID - 64))) {        // if USART 6 interrupt is not disabled
                    ptrVect->processor_interrupts.irq_USART6();          // call the interrupt handler
                }
            }
	    }
        break;
    #elif defined _STM32L4X5 || defined _STM32L4X6
    case 5:                                                              // LPUART 1
	    while (usLen-- != 0) {
		    LPUART1_RDR = *ptrDebugIn++;                                 // put received byte to input buffer
            LPUART1_ISR |= USART_ISR_RXNE;
            if (LPUART1_CR1 & USART_CR1_RXNEIE) {                        // if rx interrupts enabled
                if (IRQ64_95_SER & (1 << (irq_LPUART1_ID - 64))) {       // if LPUART 1 interrupt is not disabled
                    ptrVect->processor_interrupts.irq_LPUART1();         // call the interrupt handler
                }
            }
	    }
        break;
    #endif
    #if CHIP_HAS_UARTS > 6
    case 6:                                                              // USART 7
	    while (usLen-- != 0) {
        #if defined _STM32F7XX
		    UART7_RDR = *ptrDebugIn++;                                   // put received byte to input buffer
            UART7_ISR |= USART_ISR_RXNE;
        #else
		    UART7_DR = *ptrDebugIn++;                                    // put received byte to input buffer
            UART7_SR |= USART_SR_RXNE;
        #endif
            if (UART7_CR1 & USART_CR1_RXNEIE) {                          // if rx interrupts enabled
                if (IRQ64_95_SER & (1 << (irq_UART7_ID - 64))) {         // if USART 7 interrupt is not disabled
                    ptrVect->processor_interrupts.irq_UART7();           // call the interrupt handler
                }
            }
	    }
        break;
    #endif
    #if CHIP_HAS_UARTS > 7
    case 7:                                                              // USART 8
	    while (usLen-- != 0) {
        #if defined _STM32F7XX
		    UART8_RDR = *ptrDebugIn++;                                   // put received byte to input buffer
            UART8_ISR |= USART_ISR_RXNE;
        #else
		    UART8_DR = *ptrDebugIn++;                                    // put received byte to input buffer
            UART8_SR |= USART_SR_RXNE;
        #endif
            if ((UART8_CR1 & USART_CR1_RXNEIE) != 0) {                   // if rx interrupts enabled
                if (IRQ64_95_SER & (1 << (irq_UART8_ID - 64))) {         // if USART 8 interrupt is not disabled
                    ptrVect->processor_interrupts.irq_UART8();           // call the interrupt handler
                }
            }
	    }
        break;
    #endif
    default:
        break;
    }
#endif
}

extern void fnSimulateModemChange(int iPort, unsigned long ulNewState, unsigned long ulOldState)
{
#if defined SUPPORT_HW_FLOW
    switch (iPort) {
    case 0:
        break;
    case 1:
        break;
    case 2:
        break;
    case 3:
        break;
    case 4:
        break;
    #if defined _STM32F2XX || defined _STM32F4XX || defined _STM32F7XX
    case 5:
        break;
    #endif
    }
#endif
}

// UART Break detection simulation
//
extern void fnSimulateBreak(int iPort)
{
}

#if defined SUPPORT_KEY_SCAN
static unsigned char fnMapPortBit(unsigned short usRealBit)              // {11}
{
    unsigned char ucBit = 0;

    while (ucBit < 16) {
        ucBit++;
        if ((usRealBit & (1 << ucBit)) != 0) {
            return (15 - ucBit);
        }
    }
    return 0;
}


int iKeyPadInputs[KEY_COLUMNS][KEY_ROWS] = {0};

extern void fnSimulateKeyChange(int *intTable)
{
    memcpy(iKeyPadInputs, intTable, sizeof(iKeyPadInputs));              // copy key pad state to local set
}

static int fnColumnLow(int iColumnOutput)
{
    #if defined KEY_COLUMNS
    switch (iColumnOutput) {
    case 0:
        return (KEY_COL_OUT_1 & ~KEY_COL_OUT_PORT_1 & KEY_COL_OUT_DDR_1 && KEY_COL_OUTFUNC_PORT_1());
        #if KEY_COLUMNS > 1
    case 1:
        return (KEY_COL_OUT_2 & ~KEY_COL_OUT_PORT_2 & KEY_COL_OUT_DDR_2 && KEY_COL_OUTFUNC_PORT_2());
        #endif
        #if KEY_COLUMNS > 2
    case 2:
        return (KEY_COL_OUT_3 & ~KEY_COL_OUT_PORT_3 & KEY_COL_OUT_DDR_3 && KEY_COL_OUTFUNC_PORT_3());
        #endif
        #if KEY_COLUMNS > 3
    case 3:
        return (KEY_COL_OUT_4 & ~KEY_COL_OUT_PORT_4 & KEY_COL_OUT_DDR_4 && KEY_COL_OUTFUNC_PORT_4());
        #endif
        #if KEY_COLUMNS > 4
    case 4:
        return (KEY_COL_OUT_5 & ~KEY_COL_OUT_PORT_5 & KEY_COL_OUT_DDR_5 && KEY_COL_OUTFUNC_PORT_5());
        #endif
        #if KEY_COLUMNS > 5
    case 5:
        return (KEY_COL_OUT_6 & ~KEY_COL_OUT_PORT_6 & KEY_COL_OUT_DDR_6 && KEY_COL_OUTFUNC_PORT_6());
        #endif
        #if KEY_COLUMNS > 6
    case 6:
        return (KEY_COL_OUT_7 & ~KEY_COL_OUT_PORT_7 & KEY_COL_OUT_DDR_7 && KEY_COL_OUTFUNC_PORT_7());
        #endif
        #if KEY_COLUMNS > 7
    case 7:
        return (KEY_COL_OUT_8 & ~KEY_COL_OUT_PORT_8 & KEY_COL_OUT_DDR_8 && KEY_COL_OUTFUNC_PORT_8());
        #endif
    }
    #endif
    return 0;
}

static void fnSetRowInput(int iRowInput, int iState)
{
    int iChange;

    if (iState) {
        iChange = CLEAR_INPUT;
    }
    else {
        iChange = SET_INPUT;
    }

    switch (iRowInput) {
    case 0:
    #if defined KEY_ROWS
        fnSimulateInputChange(KEY_ROW_IN_PORT_1_REF, fnMapPortBit(KEY_ROW_IN_1), iChange);
    #endif
        break;
    case 1:
    #if KEY_ROWS > 1
        fnSimulateInputChange(KEY_ROW_IN_PORT_2_REF, fnMapPortBit(KEY_ROW_IN_2), iChange);
    #endif
        break;
    case 2:
    #if KEY_ROWS > 2
        fnSimulateInputChange(KEY_ROW_IN_PORT_3_REF, fnMapPortBit(KEY_ROW_IN_3), iChange);
    #endif
        break;
    case 3:
    #if KEY_ROWS > 3
        fnSimulateInputChange(KEY_ROW_IN_PORT_4_REF, fnMapPortBit(KEY_ROW_IN_4), iChange);
    #endif
        break;
    case 4:
    #if KEY_ROWS > 4
        fnSimulateInputChange(KEY_ROW_IN_PORT_5_REF, fnMapPortBit(KEY_ROW_IN_5), iChange);
    #endif
        break;
    case 5:
    #if KEY_ROWS > 5
        fnSimulateInputChange(KEY_ROW_IN_PORT_6_REF, fnMapPortBit(KEY_ROW_IN_6), iChange);
    #endif
        break;
    case 6:
    #if KEY_ROWS > 6
        fnSimulateInputChange(KEY_ROW_IN_PORT_7_REF, fnMapPortBit(KEY_ROW_IN_7), iChange);
    #endif
        break;
    case 7:
    #if KEY_ROWS > 7
        fnSimulateInputChange(KEY_ROW_IN_PORT_8_REF, fnMapPortBit(KEY_ROW_IN_8), iChange);
    #endif
        break;
    }
}

// This routine updates the ports to respect the present setting of a connected matrix key pad
//
extern void fnSimMatrixKB(void)
{
    int i, j;

