uTasker/uTasker-Kinetis/Hardware/STM32/STM32Sim.c
    iFlagRefresh = fnPortChanges(1);                                     // synchronise with present settings
    // Check whether a column control is being driven low. If this is the case, any pressed ones in the column are seen at the row input
    //
    for (i = 0; i < KEY_COLUMNS; i++) {
        if (fnColumnLow(i)) {
            for (j = 0; j < KEY_ROWS; j++) {
                fnSetRowInput(j, iKeyPadInputs[i][j]);
            }
        }
    }
}
#endif

static void fnHandleExti(unsigned short usOriginal, unsigned short usNew, unsigned char ucPort)
{
    VECTOR_TABLE *ptrVect = (VECTOR_TABLE *)VECTOR_TABLE_OFFSET_REG;
    int iInputCount = 0;
    #if defined _STM32F2XX || defined _STM32F4XX || defined _STM32F7XX || defined _STM32L432 || defined _STM32L0x1 || defined _STM32F031 || defined _STM32L4X5 || defined _STM32L4X6
    unsigned long *ptrMux = SYSCFG_EXTICR1_ADDR;
    #else
    unsigned long *ptrMux = AFIO_EXTICR1_ADD;
    #endif
    unsigned short usChange  = (usOriginal ^ usNew);                     // changed input(s)
    unsigned short usRising  = (usChange & usNew);                       // positive changes
    unsigned short usFalling = (usChange & ~usNew);                      // negative changes
    unsigned short usBit = 0x0001;
    while (usChange != 0) {                                              // while all changes have not been checked
        if ((usChange & usBit) != 0) {                                   // change on this input
            if (((*ptrMux >> (4 * iInputCount)) & 0xf) == ucPort) {      // if this input is connected to this port
                if (((usBit & usRising & EXTI_RTSR) != 0) || ((usBit & usFalling & EXTI_FTSR) != 0)) {  // if the particular edge is enabled
                    EXTI_PR |= usBit;                                    // set the interrupt pending bit
                    if ((usBit & EXTI_IMR) != 0) {                       // interrupt not masked
    #if defined irq_EXTI0_ID
                        if ((usBit & 0x0001) != 0) {
                            if (IRQ0_31_SER & (1 << irq_EXTI0_ID)) {    // if EXTI0 interrupt is not disabled
                                ptrVect->processor_interrupts.irq_EXTI0(); // call the interrupt handler
                            }
                        }
                        else if ((usBit & 0x0002) != 0) {
                            if (IRQ0_31_SER & (1 << irq_EXTI1_ID)) {    // if EXTI1 interrupt is not disabled
                                ptrVect->processor_interrupts.irq_EXTI1(); // call the interrupt handler
                            }
                        }
                        else if ((usBit & 0x0004) != 0) {
                            if (IRQ0_31_SER & (1 << irq_EXTI2_ID)) {    // if EXTI2 interrupt is not disabled
                                ptrVect->processor_interrupts.irq_EXTI2(); // call the interrupt handler
                            }
                        }
                        else if ((usBit & 0x0008) != 0) {
                            if (IRQ0_31_SER & (1 << irq_EXTI3_ID)) {    // if EXTI3 interrupt is not disabled
                                ptrVect->processor_interrupts.irq_EXTI3(); // call the interrupt handler
                            }
                        }
                        else if ((usBit & 0x0010) != 0) {
                            if ((IRQ0_31_SER & (1 << irq_EXTI4_ID)) != 0) {    // if EXTI3 interrupt is not disabled
                                ptrVect->processor_interrupts.irq_EXTI4(); // call the interrupt handler
                            }
                        }
                        else if ((usBit & 0x03e0) != 0) {
                            if (IRQ0_31_SER & (1 << irq_EXTI9_5_ID)) {   // if EXTI5..9 interrupt is not disabled
                                ptrVect->processor_interrupts.irq_EXTI9_5(); // call the interrupt handler
                            }
                        }
                        else if ((usBit & 0xfc00) != 0) {
                            if (IRQ32_63_SER & (1 << (irq_EXTI15_10_ID - 32))) { // if EXTI10..15 interrupt is not disabled
                                ptrVect->processor_interrupts.irq_EXTI15_10(); // call the interrupt handler
                            }
                        }
    #endif
                    }
                }
            }
            usChange &= ~usBit;
        }
        usBit <<= 1;
        iInputCount++;
        if (iInputCount == 4) {
            iInputCount = 0;
            ptrMux++;
        }
        iFlagRefresh = PORT_CHANGE;                                      // ensure that ports are updated when a peripheral function changes
    }
}

extern void fnSimulateInputChange(unsigned char ucPort, unsigned char ucPortBit, int iChange)
{
    unsigned short usBit;
    unsigned short usOriginal;
    ucPortBit = (15 - ucPortBit);
    usBit = (0x01 << ucPortBit);
    if ((ulGPIODDR[ucPort] & usBit) != 0) {                              // check whether the pin is programmed as an output
        return;                                                          // pin is not programmed as an input
    }
    if (__GPIO_IS_POWERED(ucPort) == 0) {
        return;                                                          // not clocked so ignore
    }
    if (__GPIO_IS_IN_RESET(ucPort) != 0) {
        return;                                                          // in reset so ignore
    }
    usOriginal = (unsigned short)ulGPIOIN[ucPort];
    if (iChange == TOGGLE_INPUT) {
        ulGPIOIN[ucPort] ^= usBit;                                       // toggle the input state
    }
    else if (iChange == SET_INPUT) {
        ulGPIOIN[ucPort] |= usBit;                                       // set the input high
    }
    else {
        ulGPIOIN[ucPort] &= ~usBit;                                      // set the input low
    }
    switch (ucPort) {
    case _PORTA:
        GPIOA_IDR = ((ulGPIODDR[ucPort] & GPIOA_ODR) | (~ulGPIODDR[ucPort] & ulGPIOIN[ucPort]));
        break;
    case _PORTB:
        GPIOB_IDR = ((ulGPIODDR[ucPort] & GPIOB_ODR) | (~ulGPIODDR[ucPort] & ulGPIOIN[ucPort]));
        break;
    case _PORTC:
        GPIOC_IDR = ((ulGPIODDR[ucPort] & GPIOC_ODR) | (~ulGPIODDR[ucPort] & ulGPIOIN[ucPort]));
        break;
    case _PORTD:
        GPIOD_IDR = ((ulGPIODDR[ucPort] & GPIOD_ODR) | (~ulGPIODDR[ucPort] & ulGPIOIN[ucPort]));
        break;
    case _PORTE:
        GPIOE_IDR = ((ulGPIODDR[ucPort] & GPIOE_ODR) | (~ulGPIODDR[ucPort] & ulGPIOIN[ucPort]));
        break;
    case _PORTF:
        GPIOF_IDR = ((ulGPIODDR[ucPort] & GPIOF_ODR) | (~ulGPIODDR[ucPort] & ulGPIOIN[ucPort]));
        break;
    case _PORTG:
        GPIOG_IDR = ((ulGPIODDR[ucPort] & GPIOG_ODR) | (~ulGPIODDR[ucPort] & ulGPIOIN[ucPort]));
        break;
#if defined _STM32F2XX || defined _STM32F4XX || defined _STM32F7XX
    case _PORTH:
        GPIOH_IDR = ((ulGPIODDR[ucPort] & GPIOH_ODR) | (~ulGPIODDR[ucPort] & ulGPIOIN[ucPort]));
        break;
    case _PORTI:
        GPIOI_IDR = ((ulGPIODDR[ucPort] & GPIOI_ODR) | (~ulGPIODDR[ucPort] & ulGPIOIN[ucPort]));
        break;
#endif
    }
    fnHandleExti(usOriginal, (unsigned short)ulGPIOIN[ucPort], ucPort);  // handle possible port change interrupts
}


