uTasker/uTasker-Kinetis/Hardware/STM32/STM32Sim.c
// Simulate buffers for Ethernet use
//
unsigned char *fnGetSimTxBufferAdd(void)
{
#if defined ETH_INTERFACE
    return (fnGetTxBufferAdd(0));
#else
    return 0;
#endif
}



#if defined ETH_INTERFACE
    extern int fnCheckEthernetMode(unsigned char *ucData, unsigned short usLen);
#endif

extern int fnSimulateEthernetIn(unsigned char *ucData, unsigned short usLen, int iForce)
{
#if defined ETH_INTERFACE                                                // we feed frames in promiscuous mode and filter them according to their details
    VECTOR_TABLE *ptrVect = (VECTOR_TABLE *)VECTOR_TABLE_OFFSET_REG;
    int iType;
    STM32_BD *ptrRxBd;

    if ((!iForce) && (!(iType = fnCheckEthernetMode(ucData, usLen)))) {  // if we are not in promiscuous mode and the MAC address is not defined to be received we ignore the frame
        return 0;
    }
    ptrRxBd = (STM32_BD *)ETH_DMACHRDR;                                  // present receive buffer description
    if ((ptrRxBd->bd_word1 & RX_BD_WORD1_RBS1_MASK) < usLen) {           // check that the buffer has enough space
        usLen = (unsigned short)(ptrRxBd->bd_word1 & RX_BD_WORD1_RBS1_MASK);
    }
    ptrRxBd->bd_word0 &= ~(RX_BD_WORD0_FL_MASK | RX_BD_WORD0_OWN | RX_BD_WORD0_FT | RX_BD_WORD0_PCE | RX_BD_WORD0_IPHCE);
    ptrRxBd->bd_word0 |= ((usLen + 4) << RX_BD_WORD0_FL_SHIFT);          // size including CRC
    uMemcpy((unsigned char *)ptrRxBd->bd_dma_buf1_address, ucData, usLen); // copy frame to input buffer
    if (((ucData[12] == 0x08) && (ucData[13] == 0x00)) || (((ucData[12] == 0x86) && (ucData[13] == 0xdd)))) { // if IPv4 or IPv6 (no VLAN expected)
        ptrRxBd->bd_word0 |= RX_BD_WORD0_FT;                             // IPv4/v6 type frame
        if (ETH_MACCR & ETH_MACCR_IPCO) {                                // if reception checksum enabled
          //ptrRxBd->bd_word0 |= (RX_BD_WORD0_PCE | RX_BD_WORD0_IPHCE);  // error could be signalled here
        }
    }
    ETH_DMACHRDR = (unsigned long)ptrRxBd->bd_dma_buf2_address;          // next receive buffer descriptor
    ETH_DMASR |= ETH_DMAIER_RIE;                                         // set the status flag
    if (ETH_DMAIER & ETH_DMAIER_RIE) {                                   // if receive interrupt is enabled
        IRQ32_63_SPR |= (1 << (irq_ETH_ID - 32));
        IRQ32_63_CPR = IRQ32_63_SPR;
        if (IRQ32_63_SER & (1 << (irq_ETH_ID - 32))) {                   // if Ethernet interrupt is not disabled
            ptrVect->processor_interrupts.irq_ETH();                     // call the interrupt handler
        }
    }
    return 1;
#else
    return 0;
#endif
}

static void fnUpdatePeripheral(int iPort, unsigned long ulPeriph)
{
    int i = 0;
#if defined _STM32F2XX || defined _STM32F4XX || defined _STM32F7XX || defined _STM32L432 || defined _STM32L0x1 || defined _STM32F031 || defined _STM32L4X5 || defined _STM32L4X6
    int iHigh = 0;
    int iFunctionShift = 0;
    unsigned long ulMaskMode = 0x00000003;
    STM32_GPIO *ptrPort = &STM32.Ports[iPort];
    while (i < PORT_WIDTH) {
        if ((iPort == _PORTH) && (i <= 1)) {                            // {2}
            if ((RCC_CR & RCC_CR_HSEON) != 0) {                          // if external oscillator is enabled
                ucPortFunctions[iPort][i] = _ADDITIONAL_FUNCTION;        // OSC_IN and OSC_OUT enabled on PH0 and PH1
            }
        }
        else {
            if (((ptrPort->GPIO_MODER & ulMaskMode) >> (i * 2)) == GPIO_MODER_ALTERNATE_FUNC) { // if port bit set as alternative function
                if (iHigh == 0) {
                    ucPortFunctions[iPort][i] = (unsigned char)((ptrPort->GPIO_AFRL >> iFunctionShift) & 0x0000000f);
                }
                else {
                    ucPortFunctions[iPort][i] = (unsigned char)((ptrPort->GPIO_AFRH >> iFunctionShift) & 0x0000000f);
                }
            }
            else if (((ptrPort->GPIO_MODER & ulMaskMode) >> (i * 2)) == GPIO_MODER_ANALOG) { // if port bit set as analog function
                ucPortFunctions[iPort][i] = 16;                          // additional
            }
            else {
                ucPortFunctions[iPort][i] = 0;
            }
        }
        ulMaskMode <<= 2;
        iFunctionShift += 4;
        if (iFunctionShift >= 32) {
            iFunctionShift = 0;
            iHigh = 1;
        }
        i++;
    }
#else
    unsigned long ulBit = 0x00000001;
    switch (iPort) {
    case _PORTA:
        while (i < PORT_WIDTH) {
            if (ulBit & ulPeriph) {                                      // for each port bit that has a peripheral function
                switch (i) {
                case 0:
                case 1:
    #if defined ETH_INTERFACE
                    if ((AFIO_MAPR & MII_RMII_SEL) == 0) {               // MII
                        ucPortFunctions[iPort][i] = 0;                   // this matches with the value in STM32_ports.c
                    }
                    else {                                               // RMII
                    }
    #endif
                    break;
                case 2:
                    if (((AFIO_MAPR & USART2_REMAPPED) == 0) && ((USART2_CR1 & USART_CR1_RE) != 0)) {
                        ucPortFunctions[iPort][i] = 3;                   // USART2_TX
                    }
                    break;
                case 3:
                    if ((!(AFIO_MAPR & USART2_REMAPPED)) && (USART2_CR1 & USART_CR1_RE)) {
                        ucPortFunctions[iPort][i] = 3;                   // USART2_RX
                    }
                    else {
    #if defined ETH_INTERFACE
                        if (!(AFIO_MAPR & MII_RMII_SEL)) {               // MII
                            ucPortFunctions[iPort][i] = 0;               // ETH_MII_MDIO
                        }
                        else {                                           // RMII
                        }
    #endif
                    }
                    break;
                case 6:
                    if ((AFIO_MAPR & TIM3_FULL_REMAP) == 0) {
                        ucPortFunctions[iPort][i] = 1;                   // TIM3_CH1 this matches with the value in STM32_ports.c
                    }                    
                    break;
                case 7:
    #if defined _CONNECTIVITY_LINE
                    if (ETH_MACCR & (ETH_MACCR_RE | ETH_MACCR_TE)) {     // {5}
                        ucPortFunctions[iPort][i] = 3;
                        break;
                    }
    #endif
                    if ((AFIO_MAPR & TIM3_FULL_REMAP) == 0) {
                        ucPortFunctions[iPort][i] = 1;                   // TIM3_CH2 this matches with the value in STM32_ports.c
                    }                    
                    break;
                case 8:
                    ucPortFunctions[iPort][i] = 0;                       // this matches with the value in STM32_ports.c
                    break;
                case 9:
    #if defined _CONNECTIVITY_LINE                                       // {4}
                    if ((OTG_FS_GCCFG & OTG_FS_GCCFG_PWRDWN) != 0) {     // if USB PHY is enabled
                        if (OTG_FS_GCCFG & (OTG_FS_GCCFG_VBUSASEN | OTG_FS_GCCFG_VBUSBSEN)) { // bus monitoring enabled
                            ucPortFunctions[iPort][i] = 3;               // peripheral USB_VBUS
                            break;
                        }
                    }
    #endif
                case 10:
                    ucPortFunctions[iPort][i] = 1;                       // UART1
                    break;
                case 11:
                case 12:
    #if defined _CONNECTIVITY_LINE && defined USB_OTG_AVAILABLE          // {4}
                    if ((OTG_FS_GCCFG & OTG_FS_GCCFG_PWRDWN) != 0) {     // if USB PHY is enabled
                        ucPortFunctions[iPort][i] = 3;                   // peripheral USB_VBUS
                    }
                    break;
    #elif defined _PERFORMANCE_LINE && defined USB_DEVICE_AVAILABLE
                    if ((USB_CNTR & USB_CNTR_PDWN) == 0) {               // if USB PHY is connected
                        ucPortFunctions[iPort][i] = 2;                   // USBDP/USBDM
                    }
    #endif
                    break;
                }
            }
            i++;
            ulBit <<= 1;
        }
        break;
    case _PORTB:
        while (i < PORT_WIDTH) {
            if (ulBit & ulPeriph) {                                      // for each port bit that has a peripheral function enabled
                switch (i) {
                case 0:
                case 1:
                    if (((AFIO_MAPR & TIM3_FULL_REMAP) == TIM3_PARTIAL_REMAP) || ((AFIO_MAPR & TIM3_FULL_REMAP) == 0)) {
                        ucPortFunctions[iPort][i] = 1;                   // TIM3_CH3 / TIM3_CH4 this matches with the value in STM32_ports.c
                    }
                    break;
                case 4:
                    if ((AFIO_MAPR & TIM3_FULL_REMAP) == TIM3_PARTIAL_REMAP) {
                        ucPortFunctions[iPort][i] = 0;                   // TIM3_CH1 this matches with the value in STM32_ports.c
                    }                    
                    break;
                case 5:
                    if ((AFIO_MAPR & TIM3_FULL_REMAP) == TIM3_PARTIAL_REMAP) {
                        ucPortFunctions[iPort][i] = 1;                   // TIM3_CH2 this matches with the value in STM32_ports.c
                    }
                    else {
                        ucPortFunctions[iPort][i] = 0;
                    }
                    break;
                case 6:
                    if ((AFIO_MAPR & USART1_REMAPPED) && (USART1_CR1 & USART_CR1_TE)) { // if USART1 tx is enabled
                        ucPortFunctions[iPort][i] = 1;                   // USART1_TX
                    }
                    else {
                        ucPortFunctions[iPort][i] = 0;                   // I2C1_SDA
                    }
                    break;
                case 7:
                    if ((AFIO_MAPR & USART1_REMAPPED) && (USART1_CR1 & USART_CR1_RE)) { // if USART1 rx is enabled
                        ucPortFunctions[iPort][i] = 1;                   // USART1_RX
                    }
                    else {
                        ucPortFunctions[iPort][i] = 0;                   // I2C1_SDA
                    }
                    break;
                case 8:
                    ucPortFunctions[iPort][i] = 0;                       // this matches with the value in STM32_ports.c
                    break;
                case 10:
    #if defined _CONNECTIVITY_LINE
                    if ((ETH_MACCR & (ETH_MACCR_RE | ETH_MACCR_TE)) != 0) { // EMAC is enabled so assume this use
                        if ((AFIO_MAPR & MII_RMII_SEL) == 0) {           // {5} only in MII mode
                            ucPortFunctions[iPort][i] = 0;               // ETH_MII_RX_ER
                        }
                        break;
                    }
    #endif
    #if USARTS_AVAILABLE > 2
                    if (((AFIO_MAPR & USART3_FULLY_REMAPPED) == 0) && ((USART3_CR1 & USART_CR1_RE) != 0)) {
                        ucPortFunctions[iPort][i] = 0;                   // USARTRX3
                    }
                    else {
                        ucPortFunctions[iPort][i] = 3;                   // I2C2_SCL
                    }
    #endif
                    break;
                case 11:
                    if (ETH_MACCR & (ETH_MACCR_RE | ETH_MACCR_TE)) {     // EMAC is enabled so assume this use
                        ucPortFunctions[iPort][i] = 0;                   // ETH_MII_TX_EN
                    }
    #if USARTS_AVAILABLE > 2
                    else if (((AFIO_MAPR & USART3_FULLY_REMAPPED) == 0) && ((USART3_CR1 & USART_CR1_RE) != 0)) {
                        ucPortFunctions[iPort][i] = 0;                   // USART3_RX
                    }
    #endif
                    else {
                        ucPortFunctions[iPort][i] = 3;                   // I2C2_SDA
                    }
                    break;
                case 12:
                case 13:
                    ucPortFunctions[iPort][i] = 0;                       // this matches with the value in STM32_ports.c
                    break;
                }
            }
            i++;
            ulBit <<= 1;
        }
        break;
    case _PORTC:
        while (i < PORT_WIDTH) {
            if (ulBit & ulPeriph) {                                      // for each port bit that has a peripheral function
                switch (i) {
                case 1:
                case 2:
                case 3:
                    ucPortFunctions[iPort][i] = 0;                       // this matches with the value in STM32_ports.c
                    break;
                case 6:
                case 7:
                case 8:
                case 9:
                    if ((AFIO_MAPR & TIM3_FULL_REMAP) == TIM3_FULL_REMAP) {
                        ucPortFunctions[iPort][i] = 0;                   // TIM3_CHx this matches with the value in STM32_ports.c
                    }
                    break;
                case 10:
    #if USARTS_AVAILABLE > 2
                    if (((AFIO_MAPR & USART3_FULLY_REMAPPED) == USART3_PARTIALLY_REMAPPED) && ((USART3_CR1 & USART_CR1_TE) != 0)) {
                        ucPortFunctions[iPort][i] = 1;                   // USART3_TX
                    }
        #if defined _CONNECTIVITY_LINE
                    else if (AFIO_MAPR & SPI3_REMAP) {                   // alternative mapping (SPI3 PA4:PC10:PC11:PC12)
                        ucPortFunctions[iPort][i] = 0;                   // SPI3 this matches with the value in STM32_ports.c
                    }
        #endif
    #endif
                    break;
                case 11:
    #if USARTS_AVAILABLE > 2
                    if (((AFIO_MAPR & USART3_FULLY_REMAPPED) == USART3_PARTIALLY_REMAPPED) && ((USART3_CR1 & USART_CR1_RE) != 0)) {
                        ucPortFunctions[iPort][i] = 1;                   // USART3_RX
                    }
        #if defined _CONNECTIVITY_LINE
                    else if (AFIO_MAPR & SPI3_REMAP) {                   // alternative mapping (SPI3 PA4:PC10:PC11:PC12)
                        ucPortFunctions[iPort][i] = 0;                   // SPI3 this matches with the value in STM32_ports.c
                    }
        #endif
    #endif
                    break;
                case 12:
    #if defined _CONNECTIVITY_LINE
                    if (AFIO_MAPR & SPI3_REMAP) {                        // alternative mapping (SPI3 PA4:PC10:PC11:PC12)
                        ucPortFunctions[iPort][i] = 0;                   // SPI3 this matches with the value in STM32_ports.c
                    }
    #endif
                    break;
                }
            }
            i++;
            ulBit <<= 1;
        }
        break;
    case _PORTD:
        while (i < PORT_WIDTH) {
            if (ulBit & ulPeriph) {                                      // for each port bit that has a peripheral function
                switch (i) {
                case 8:
    #if USARTS_AVAILABLE > 2
                    if (((AFIO_MAPR & USART3_FULLY_REMAPPED) == USART3_FULLY_REMAPPED) && ((USART3_CR1 & USART_CR1_TE) != 0)) {
                        ucPortFunctions[iPort][i] = 2;                   // USART3_TX
                    }
        #if defined _CONNECTIVITY_LINE
                    else if ((AFIO_MAPR & ETH_REMAP) != 0) {             // alternative mapping (EMAC PD8:PD9:PD10:PD11:PD12)
                        if ((AFIO_MAPR & MII_RMII_SEL) == 0) {           // MII
                            ucPortFunctions[iPort][i] = 0;               // this matches with the value in STM32_ports.c
                        }
                        else {                                           // RMII
                        }
                    }
        #endif
    #endif
                    break;
                case 9:
    #if USARTS_AVAILABLE > 2
                    if (((AFIO_MAPR & USART3_FULLY_REMAPPED) == USART3_FULLY_REMAPPED) && ((USART3_CR1 & USART_CR1_RE) != 0)) {
                        ucPortFunctions[iPort][i] = 2;                   // USART3_RX
                    }
        #if defined _CONNECTIVITY_LINE
                    else if (AFIO_MAPR & ETH_REMAP) {                    // alternative mapping (EMAC PD8:PD9:PD10:PD11:PD12)
                        if (!(AFIO_MAPR & MII_RMII_SEL)) {               // MII
                            ucPortFunctions[iPort][i] = 0;               // this matches with the value in STM32_ports.c
                        }
                        else {                                           // RMII
                        }
                    }
        #endif
    #endif
                    break;
                case 10:
                case 11:
                case 12:
    #if defined _CONNECTIVITY_LINE
                    if (AFIO_MAPR & ETH_REMAP) {                         // alternative mapping (EMAC PD8:PD9:PD10:PD11:PD12)
                        if (!(AFIO_MAPR & MII_RMII_SEL)) {               // MII
                            ucPortFunctions[iPort][i] = 0;               // this matches with the value in STM32_ports.c
                        }
                        else {                                           // RMII
                        }
                    }
    #endif
                    break;
                case 5:
                case 6:
                    if (AFIO_MAPR & USART2_REMAPPED) {
                        ucPortFunctions[iPort][i] = 1;                   // this matches with the value in STM32_ports.c
                    }
                    break;
                }
            }
            i++;
            ulBit <<= 1;
        }
        break;
    case _PORTE:
        while (i < PORT_WIDTH) {
            if (ulBit & ulPeriph) {                                      // for each port bit that has a peripheral function
                switch (i) {
                default:
                    break;
                }
            }
            i++;
            ulBit <<= 1;
        }
        break;
    case _PORTF:
        while (i < PORT_WIDTH) {
            if (ulBit & ulPeriph) {                                      // for each port bit that has a peripheral function
                switch (i) {
                default:
                    break;
                }
            }
            i++;
            ulBit <<= 1;
        }
        break;
    case _PORTG:
        while (i < PORT_WIDTH) {
            if (ulBit & ulPeriph) {                                      // for each port bit that has a peripheral function
                switch (i) {
                default:
                    break;
                }
            }
            i++;
            ulBit <<= 1;
        }
        break;
    }
#endif
}

