uTasker/uTasker-Kinetis/Hardware/STM32/STM32Sim.c
// We can update port state displays if we want
//
extern void fnSimPorts(void)
{
    unsigned long ulNewPeriph;
    int iPort = 0;

    while (iPort < PORTS_AVAILABLE) {
        ulNewPeriph = fnGetPresentPortPeriph(iPort + 1);
        if (ulGPIOPER[iPort] != ulNewPeriph) {
            ulGPIOPER[iPort] = ulNewPeriph;
            fnUpdatePeripheral(iPort, ulNewPeriph);                      // update peripheral details
            iFlagRefresh = PORT_CHANGE;                                  // ensure that ports are updated when a peripheral function changes
        }
        ulNewPeriph = fnGetPortType(iPort, GET_OUTPUTS, 0);
        if (ulGPIODDR[iPort] != ulNewPeriph) {
            ulGPIODDR[iPort] = ulNewPeriph;
            iFlagRefresh = PORT_CHANGE;                                  // ensure that ports are updated when a direction changes
        }
        switch (iPort) {
        case _PORTA:
            if ((GPIOA_ODR & ulGPIODDR[iPort]) != ulGPIODRIVE_VALUE[iPort]) {
                ulGPIODRIVE_VALUE[iPort] = GPIOA_ODR & ulGPIODDR[iPort]; // new output driven state
                GPIOA_IDR = ((ulGPIODDR[iPort] & GPIOA_ODR) | (~ulGPIODDR[iPort] & ulGPIOIN[iPort]));
                iFlagRefresh = PORT_CHANGE;                              // ensure that ports are updated when an output state changes
            }
            break;
        case _PORTB:
            if ((GPIOB_ODR & ulGPIODDR[iPort]) != ulGPIODRIVE_VALUE[iPort]) {
                ulGPIODRIVE_VALUE[iPort] = GPIOB_ODR & ulGPIODDR[iPort]; // new output driven state
                GPIOB_IDR = ((ulGPIODDR[iPort] & GPIOB_ODR) | (~ulGPIODDR[iPort] & ulGPIOIN[iPort]));
                iFlagRefresh = PORT_CHANGE;                              // ensure that ports are updated when an output state changes
            }
            break;
        case _PORTC:
            if ((GPIOC_ODR & ulGPIODDR[iPort]) != ulGPIODRIVE_VALUE[iPort]) {
                ulGPIODRIVE_VALUE[iPort] = GPIOC_ODR & ulGPIODDR[iPort]; // new output driven state
                GPIOC_IDR = ((ulGPIODDR[iPort] & GPIOC_ODR) | (~ulGPIODDR[iPort] & ulGPIOIN[iPort]));
                iFlagRefresh = PORT_CHANGE;                              // ensure that ports are updated when an output state changes
            }
            break;
        case _PORTD:
            if ((GPIOD_ODR & ulGPIODDR[iPort]) != ulGPIODRIVE_VALUE[iPort]) {
                ulGPIODRIVE_VALUE[iPort] = GPIOD_ODR & ulGPIODDR[iPort]; // new output driven state
                GPIOD_IDR = ((ulGPIODDR[iPort] & GPIOD_ODR) | (~ulGPIODDR[iPort] & ulGPIOIN[iPort]));
                iFlagRefresh = PORT_CHANGE;                              // ensure that ports are updated when an output state changes
            }
            break;
        case _PORTE:
            if ((GPIOE_ODR & ulGPIODDR[iPort]) != ulGPIODRIVE_VALUE[iPort]) {
                ulGPIODRIVE_VALUE[iPort] = GPIOE_ODR & ulGPIODDR[iPort]; // new output driven state
                GPIOE_IDR = ((ulGPIODDR[iPort] & GPIOE_ODR) | (~ulGPIODDR[iPort] & ulGPIOIN[iPort]));
                iFlagRefresh = PORT_CHANGE;                              // ensure that ports are updated when an output state changes
            }
            break;
        case _PORTF:
            if ((GPIOF_ODR & ulGPIODDR[iPort]) != ulGPIODRIVE_VALUE[iPort]) {
                ulGPIODRIVE_VALUE[iPort] = GPIOF_ODR & ulGPIODDR[iPort]; // new output driven state
                GPIOF_IDR = ((ulGPIODDR[iPort] & GPIOF_ODR) | (~ulGPIODDR[iPort] & ulGPIOIN[iPort]));
                iFlagRefresh = PORT_CHANGE;                              // ensure that ports are updated when an output state changes
            }
            break;
        case _PORTG:
            if ((GPIOG_ODR & ulGPIODDR[iPort]) != ulGPIODRIVE_VALUE[iPort]) {
                ulGPIODRIVE_VALUE[iPort] = GPIOG_ODR & ulGPIODDR[iPort]; // new output driven state
                GPIOG_IDR = ((ulGPIODDR[iPort] & GPIOG_ODR) | (~ulGPIODDR[iPort] & ulGPIOIN[iPort]));
                iFlagRefresh = PORT_CHANGE;                              // ensure that ports are updated when an output state changes
            }
            break;
#if defined _STM32F2XX || defined _STM32F4XX || defined _STM32F7XX
        case _PORTH:
            if ((GPIOH_ODR & ulGPIODDR[iPort]) != ulGPIODRIVE_VALUE[iPort]) {
                ulGPIODRIVE_VALUE[iPort] = GPIOH_ODR & ulGPIODDR[iPort]; // new output driven state
                GPIOH_IDR = ((ulGPIODDR[iPort] & GPIOH_ODR) | (~ulGPIODDR[iPort] & ulGPIOIN[iPort]));
                iFlagRefresh = PORT_CHANGE;                              // ensure that ports are updated when an output state changes
            }
            break;
        case _PORTI:
            if ((GPIOI_ODR & ulGPIODDR[iPort]) != ulGPIODRIVE_VALUE[iPort]) {
                ulGPIODRIVE_VALUE[iPort] = GPIOI_ODR & ulGPIODDR[iPort]; // new output driven state
                GPIOI_IDR = ((ulGPIODDR[iPort] & GPIOI_ODR) | (~ulGPIODDR[iPort] & ulGPIOIN[iPort]));
                iFlagRefresh = PORT_CHANGE;                              // ensure that ports are updated when an output state changes
            }
            break;
#endif
        }
        iPort++;
    }
}


extern int fnPortChanges(int iForce)
{
    int iRtn = iFlagRefresh;
    iFlagRefresh = 0;
    return iRtn;
}

extern unsigned long fnGetPresentPortState(int portNr)
{
    portNr -= 1;
    switch (portNr) {
    case _PORTA:
        return ((ulGPIODDR[portNr] & GPIOA_ODR) | (~ulGPIODDR[portNr] & ulGPIOIN[portNr]));
    case _PORTB:
        return ((ulGPIODDR[portNr] & GPIOB_ODR) | (~ulGPIODDR[portNr] & ulGPIOIN[portNr]));
    case _PORTC:
        return ((ulGPIODDR[portNr] & GPIOC_ODR) | (~ulGPIODDR[portNr] & ulGPIOIN[portNr]));
    case _PORTD:
        return ((ulGPIODDR[portNr] & GPIOD_ODR) | (~ulGPIODDR[portNr] & ulGPIOIN[portNr]));
    case _PORTE:
        return ((ulGPIODDR[portNr] & GPIOE_ODR) | (~ulGPIODDR[portNr] & ulGPIOIN[portNr]));
    case _PORTF:
        return ((ulGPIODDR[portNr] & GPIOF_ODR) | (~ulGPIODDR[portNr] & ulGPIOIN[portNr]));
    case _PORTG:
        return ((ulGPIODDR[portNr] & GPIOG_ODR) | (~ulGPIODDR[portNr] & ulGPIOIN[portNr]));
#if defined _STM32F2XX || defined _STM32F4XX || defined _STM32F7XX
    case _PORTH:
        return ((ulGPIODDR[portNr] & GPIOH_ODR) | (~ulGPIODDR[portNr] & ulGPIOIN[portNr]));
    case _PORTI:
        return ((ulGPIODDR[portNr] & GPIOI_ODR) | (~ulGPIODDR[portNr] & ulGPIOIN[portNr]));
#endif
    default:
        return 0;
    }
}


static unsigned short fnGetPortType(int portNr, int iRequest, int i)
{
    unsigned short usPeripherals = 0;
    unsigned short usBit = 0x0001;
#if defined _STM32F2XX || defined _STM32F4XX || defined _STM32F7XX || defined _STM32L432 || defined _STM32L0x1 || defined _STM32F031 || defined _STM32L4X5 || defined _STM32L4X6
    unsigned long ulMask = 0x00000003;
    STM32_GPIO *ptrPort = &STM32.Ports[portNr];
    if (GET_OUTPUTS == iRequest) {
        while (i < PORT_WIDTH) {
            if (((ptrPort->GPIO_MODER & ulMask) >> (i * 2)) == GPIO_MODER_OUTPUT) { // if port bit set as output
                usPeripherals |= usBit;
            }
            usBit <<= 1;
            ulMask <<= 2;
            i++;
        }
    }
    else if (GET_PERIPHERALS == iRequest) {
        while (i < PORT_WIDTH) {
            if (((ptrPort->GPIO_MODER & ulMask) >> (i * 2)) == GPIO_MODER_ALTERNATE_FUNC) { // if port bit set as alternative function
                usPeripherals |= usBit;
            }
            else if (((ptrPort->GPIO_MODER & ulMask) >> (i * 2)) == GPIO_MODER_ANALOG) { // if port bit set as analog function
    #if !defined _STM32L0x1
                usPeripherals |= usBit;
    #endif
            }
            usBit <<= 1;
            ulMask <<= 2;
            i++;
        }
    #if !defined _STM32L0x1
        if (portNr == _PORTH) {                                         // {2}
            if ((RCC_CR & RCC_CR_HSEON) != 0) {                          // if external oscillator is enabled
                usPeripherals |= (PORTH_BIT0 | PORTH_BIT1);              // OSC_IN and OSC_OUT enabled on PH0 and PH1
            }
        }
    #endif
    }
#else
    unsigned long  ulReg;

