uTasker/uTasker-Kinetis/Hardware/STM32/STM32Sim.c
    switch (portNr) {
    case _PORTA:
        while (i < PORT_WIDTH) {
            if (i < 8) {
                ulReg = GPIOA_CRL;
                ulReg >>= (i * 4);
            }
            else {
                ulReg = GPIOA_CRH;
                ulReg >>= ((i - 8) * 4);
            }
            switch (iRequest) {
            case GET_OUTPUTS:
                if (((ulReg & ALTERNATIVE_FUNCTION) == 0) && ((ulReg & OUTPUT_FAST) != 0)) { // mode set to output but not alternative peripheral output
                    usPeripherals |= usBit;
                }
                break;
            case GET_PERIPHERALS:                
                if (((ulReg & ALTERNATIVE_FUNCTION) != 0) && ((ulReg & OUTPUT_FAST) != 0)) { // mode set to peripheral output function
                    usPeripherals |= usBit;                              // peripheral output
                }
                else if ((ulReg & OUTPUT_FAST) == 0) {                   // input but could be attached to peripheral
                    switch (i) {
                    case 0:
                    case 1:
    #if defined _CONNECTIVITY_LINE
                        if (!(AFIO_MAPR & MII_RMII_SEL)) {               // MII
                            if (ETH_MACCR & (ETH_MACCR_RE | ETH_MACCR_TE)) { // EMAC is enabled so assume peripheral input
                                usPeripherals |= usBit;                  // peripheral input
                            }
                        }
                        else {                                           // RMII
                            if ((i == 1) && (ETH_MACCR & (ETH_MACCR_RE | ETH_MACCR_TE))) { // {5} EMAC is enabled so assume peripheral input
                                usPeripherals |= usBit;                  // peripheral input
                            }
                        }
    #endif
                        break;
                    case 3:
                        if (((AFIO_MAPR & USART2_REMAPPED) == 0) && ((USART2_CR1 & USART_CR1_RE) != 0)) {
                            usPeripherals |= usBit;                      // peripheral input
                        }
                        else {
    #if defined _CONNECTIVITY_LINE
                            if ((AFIO_MAPR & MII_RMII_SEL) == 0) {       // MII
                                if ((ETH_MACCR & (ETH_MACCR_RE | ETH_MACCR_TE)) != 0) { // EMAC is enabled so assume peripheral input
                                    usPeripherals |= usBit;              // peripheral input
                                }
                            }
                            else {                                       // RMII
                            }
    #endif
                        }
                        break;
    #if defined _CONNECTIVITY_LINE                                       // {4}
                    case 7:
                        if (ETH_MACCR & (ETH_MACCR_RE | ETH_MACCR_TE)) { // {5} EMAC is enabled so assume peripheral input
                            usPeripherals |= usBit;                      // peripheral input
                        }
                        break;
                    case 9:
                        if (OTG_FS_GCCFG & OTG_FS_GCCFG_PWRDWN) {        // if USB PHY is enabled
                            if (OTG_FS_GCCFG & (OTG_FS_GCCFG_VBUSASEN | OTG_FS_GCCFG_VBUSBSEN)) { // bus monitoring enabled
                                usPeripherals |= usBit;                  // peripheral USB_VBUS
                            }
                        }
                        break;
    #endif
                    case 10:
                        if (((AFIO_MAPR & USART1_REMAPPED) == 0) && (USART1_CR1 & USART_CR1_RE)) { // if USART1 rx is enabled
                            usPeripherals |= usBit;                      // peripheral input
                        }
                        break;
    #if defined _CONNECTIVITY_LINE && defined USB_OTG_AVAILABLE          // {4}
                    case 11:
                    case 12:
                        if ((OTG_FS_GCCFG & OTG_FS_GCCFG_PWRDWN) != 0) { // if USB PHY is enabled
                            usPeripherals |= usBit;                      // peripheral USB_DM/USB_DP
                        }
                        break;
    #elif defined _PERFORMANCE_LINE && defined USB_DEVICE_AVAILABLE
                    case 11:
                    case 12:
                        if ((USB_CNTR & USB_CNTR_PDWN) == 0) {           // if USB PHY is connected
                            usPeripherals |= usBit;                      // peripheral USB_DM/USB_DP
                        }
                        break;
    #endif
                    }
                }
                break;
            }
            usBit <<= 1;
            i++;
        }
        break;
    case _PORTB:
        while (i < PORT_WIDTH) {
            if (i < 8) {
                ulReg = GPIOB_CRL;
                ulReg >>= (i * 4);
            }
            else {
                ulReg = GPIOB_CRH;
                ulReg >>= ((i - 8) * 4);
            }
            switch (iRequest) {
            case GET_OUTPUTS:
                if ((!(ulReg & ALTERNATIVE_FUNCTION)) && (ulReg & OUTPUT_FAST)) { // mode set to output but not alternative peripheral output
                    usPeripherals |= usBit;
                }
                break;
            case GET_PERIPHERALS:                
                if ((ulReg & ALTERNATIVE_FUNCTION) && (ulReg & OUTPUT_FAST)) { // mode set to peripheral output function
                    usPeripherals |= usBit;                              // peripheral output
                }
                else if (!(ulReg & OUTPUT_FAST)) {                       // input but could be attached to peripheral
                    switch (i) {
                    case 7:
                        if ((AFIO_MAPR & USART1_REMAPPED) && (USART1_CR1 & USART_CR1_RE)) { // if USART1 rx is enabled
                            usPeripherals |= usBit;                      // peripheral input
                        }
                        break;
    #if defined _CONNECTIVITY_LINE
                    case 10:
                        if (ETH_MACCR & (ETH_MACCR_RE | ETH_MACCR_TE)) { // EMAC is enabled so assume peripheral input
                            if (!(AFIO_MAPR & MII_RMII_SEL)) {           // {5} only in MII mode
                                usPeripherals |= usBit;                  // peripheral input
                            }
                        }
                        break;
    #endif
                    case 11:
    #if USARTS_AVAILABLE > 2
                        if ((!(AFIO_MAPR & USART3_FULLY_REMAPPED)) && ((USART3_CR1 & USART_CR1_RE) != 0)) { // if USART3 rx is enabled
                            usPeripherals |= usBit;                      // peripheral input
                        }
    #endif
                        break;
                    }
                }
                break;
            }
            usBit <<= 1;
            i++;
        }
        break;
    case _PORTC:
        while (i < PORT_WIDTH) {
            if (i < 8) {
                ulReg = GPIOC_CRL;
                ulReg >>= (i * 4);
            }
            else {
                ulReg = GPIOC_CRH;
                ulReg >>= ((i - 8) * 4);
            }
            switch (iRequest) {
            case GET_OUTPUTS:
                if ((!(ulReg & ALTERNATIVE_FUNCTION)) && (ulReg & OUTPUT_FAST)) { // mode set to output but not alternative peripheral output
                    usPeripherals |= usBit;
                }
                break;
            case GET_PERIPHERALS:                
                if ((ulReg & ALTERNATIVE_FUNCTION) && (ulReg & OUTPUT_FAST)) { // mode set to peripheral output function
                    usPeripherals |= usBit;                              // peripheral output
                }
                else if (!(ulReg & OUTPUT_FAST)) {                       // input but could be attached to peripheral
                    switch (i) {
     #if defined _CONNECTIVITY_LINE
                    case 4:                                              // {5}
                    case 5:                                              // {5}
                    case 3:
                        if (ETH_MACCR & (ETH_MACCR_RE | ETH_MACCR_TE)) { // EMAC is enabled so assume peripheral input
                            if ((!(AFIO_MAPR & MII_RMII_SEL)) || (i == 4) || (i == 5)) { // {5} ignore when RMII is used
                                usPeripherals |= usBit;                  // peripheral input
                            }
                        }
                        break;
    #endif
                    case 11:
    #if USARTS_AVAILABLE > 2
                        if (((AFIO_MAPR & USART3_FULLY_REMAPPED) == USART3_PARTIALLY_REMAPPED) && ((USART3_CR1 & USART_CR1_RE) != 0)) {
                            usPeripherals |= usBit;                      // USART3_RX
                        }
                        else if ((SPI3_CR1 & SPICR1_SPE) != 0) {         // SPI3 is enabled so assume peripheral input
                            usPeripherals |= usBit;                      // peripheral input
                        }
    #endif
                        break;
                    }
                }
                break;
            }
            usBit <<= 1;
            i++;
        }
        break;
    case _PORTD:
        while (i < PORT_WIDTH) {
            if (i < 8) {
                ulReg = GPIOD_CRL;
                ulReg >>= (i * 4);
            }
            else {
                ulReg = GPIOD_CRH;
                ulReg >>= ((i - 8) * 4);
            }
            switch (iRequest) {
            case GET_OUTPUTS:
                if ((!(ulReg & ALTERNATIVE_FUNCTION)) && (ulReg & OUTPUT_FAST)) { // mode set to output but not alternative peripheral output
                    usPeripherals |= usBit;
                }
                break;
            case GET_PERIPHERALS:                
                if ((ulReg & ALTERNATIVE_FUNCTION) && (ulReg & OUTPUT_FAST)) { // mode set to peripheral output function
                    usPeripherals |= usBit;                              // peripheral output
                }
                else if ((ulReg & OUTPUT_FAST) == 0) {                   // input but could be attached to peripheral
                    switch (i) {
                    case 9:
    #if USARTS_AVAILABLE > 2
                        if (((AFIO_MAPR & USART3_FULLY_REMAPPED) == USART3_FULLY_REMAPPED) && ((USART3_CR1 & USART_CR1_RE) != 0)) {
                            usPeripherals |= usBit;                      // USART3_RX
                        }
        #if defined _CONNECTIVITY_LINE
                        else if (AFIO_MAPR & ETH_REMAP) {                // alternative mapping (EMAC PD8:PD9:PD10:PD11:PD12)
                            if (ETH_MACCR & (ETH_MACCR_RE | ETH_MACCR_TE)) { // EMAC is enabled so assume peripheral input
                                usPeripherals |= usBit;                  // peripheral input
                            }
                        }
        #endif
    #endif
                        break;
                    case 8:
                    case 10:
                    case 11:
                    case 12:
    #if defined _CONNECTIVITY_LINE
                        if (AFIO_MAPR & ETH_REMAP) {                     // alternative mapping (EMAC PD8:PD9:PD10:PD11:PD12)
                            if (ETH_MACCR & (ETH_MACCR_RE | ETH_MACCR_TE)) { // EMAC is enabled so assume peripheral input
                                if ((AFIO_MAPR & MII_RMII_SEL) && ((i == 11) || (i == 12))) { // {5} ignore in RMII mode
                                    break;
                                }
                                usPeripherals |= usBit;                  // peripheral input
                            }
                        }
    #endif
                        break;
                    case 6:
                        if (AFIO_MAPR & USART2_REMAPPED) {
                            if (USART2_CR1 & (USART_CR1_RE)) {               // if USART2 rx is enabled
                                usPeripherals |= usBit;                      // peripheral input
                            }
                        }
                        break;
                    }
                }
                break;
            }
            usBit <<= 1;
            i++;
        }
        break;
    case _PORTE:
        while (i < PORT_WIDTH) {
            if (i < 8) {
                ulReg = GPIOE_CRL;
                ulReg >>= (i * 4);
            }
            else {
                ulReg = GPIOE_CRH;
                ulReg >>= ((i - 8) * 4);
            }
            switch (iRequest) {
            case GET_OUTPUTS:
                if ((!(ulReg & ALTERNATIVE_FUNCTION)) && (ulReg & OUTPUT_FAST)) { // mode set to output but not alternative peripheral output
                    usPeripherals |= usBit;
                }
                break;
            case GET_PERIPHERALS:                
                if ((ulReg & ALTERNATIVE_FUNCTION) && (ulReg & OUTPUT_FAST)) { // mode set to peripheral output function
                    usPeripherals |= usBit;                              // peripheral output
                }
                else if (!(ulReg & OUTPUT_FAST)) {                       // input but could be attached to peripheral
                    switch (i) {
                    default:
                        break;
                    }
                }
                break;
            }
            usBit <<= 1;
            i++;
        }
        break;
    case _PORTF:
        while (i < PORT_WIDTH) {
            if (i < 8) {
                ulReg = GPIOF_CRL;
                ulReg >>= (i * 4);
            }
            else {
                ulReg = GPIOF_CRH;
                ulReg >>= ((i - 8) * 4);
            }
            switch (iRequest) {
            case GET_OUTPUTS:
                if ((!(ulReg & ALTERNATIVE_FUNCTION)) && (ulReg & OUTPUT_FAST)) { // mode set to output but not alternative peripheral output
                    usPeripherals |= usBit;
                }
                break;
            case GET_PERIPHERALS:                
                if ((ulReg & ALTERNATIVE_FUNCTION) && (ulReg & OUTPUT_FAST)) { // mode set to peripheral output function
                    usPeripherals |= usBit;                              // peripheral output
                }
                else if (!(ulReg & OUTPUT_FAST)) {                       // input but could be attached to peripheral
                    switch (i) {
                    default:
                        break;
                    }
                }
                break;
            }
            usBit <<= 1;
            i++;
        }
        break;
    case _PORTG:
        while (i < PORT_WIDTH) {
            if (i < 8) {
                ulReg = GPIOG_CRL;
                ulReg >>= (i * 4);
            }
            else {
                ulReg = GPIOG_CRH;
                ulReg >>= ((i - 8) * 4);
            }
            switch (iRequest) {
            case GET_OUTPUTS:
                if ((!(ulReg & ALTERNATIVE_FUNCTION)) && (ulReg & OUTPUT_FAST)) { // mode set to output but not alternative peripheral output
                    usPeripherals |= usBit;
                }
                break;
            case GET_PERIPHERALS:                
                if ((ulReg & ALTERNATIVE_FUNCTION) && (ulReg & OUTPUT_FAST)) { // mode set to peripheral output function
                    usPeripherals |= usBit;                              // peripheral output
                }
                else if (!(ulReg & OUTPUT_FAST)) {                       // input but could be attached to peripheral
                    switch (i) {
                    default:
                        break;
                    }
                }
                break;
            }
            usBit <<= 1;
            i++;
        }
        break;
    }
#endif
    return usPeripherals;
}


extern unsigned long fnGetPresentPortPeriph(int portNr)
{
    return (fnGetPortType((portNr - 1), GET_PERIPHERALS, 0));
}

extern unsigned long fnGetPresentPortDir(int portNr)
{
    return (fnGetPortType((portNr - 1), GET_OUTPUTS, 0));
}


