uTasker/uTasker-Kinetis/Hardware/STM32/STM32Sim.c
extern void fnSimulateLinkUp(void)
{
#if defined ETH_INTERFACE
    #if defined PHY_INTERRUPT
    unsigned long usBit = PHY_INTERRUPT;
    unsigned char ucPortBit = 0;
    while ((usBit & 0x8000) == 0) {
        ucPortBit++;
        usBit <<= 1;
    }
    fnSimulateInputChange(PHY_INT_PORT, ucPortBit, CLEAR_INPUT);         // simulate a falling edge on the PHY interrupt line
    #endif
    fnUpdateIPConfig();                                                  // update display in simulator
#endif
}


#if defined USB_INTERFACE
static unsigned char ucTxBuffer[NUMBER_OF_USB_ENDPOINTS] = {0};          // monitor the controller's transmission buffer use
static unsigned char ucRxBank[NUMBER_OF_USB_ENDPOINTS] = {0};            // monitor the buffer to inject to

// Handle data sent by USB
//
extern void fnSimUSB(int iType, int iEndpoint, USB_HW *ptrUSB_HW)
{
    extern void fnChangeUSBState(int iNewState);
    switch (iType) {
    case USB_SIM_RESET:
        {
            int x;
            fnChangeUSBState(0);
            for (x = 0; x < NUMBER_OF_USB_ENDPOINTS; x++) {
                fnLogUSB(x, 0, 0, (unsigned char *)0xffffffff, 0);       // log reset on each endpoint
            }
        }
        break;
    case USB_SIM_TX:                                                     // a frame transmission has just been started
#if defined USB_DEVICE_AVAILABLE
        if (iEndpoint != 0) {
            iInts |= USB_INT;                                            // flag that the interrupt should be handled
            ulEndpointInt |= (1 << iEndpoint);                           // flag endpoint
        }
#endif
        break;
    case USB_SIM_ENUMERATED:                                             // flag that we have completed emumeration
        fnChangeUSBState(1);
        break;
    case USB_SIM_STALL:
        fnLogUSB(iEndpoint, 0, 1, (unsigned char *)0xffffffff, 0);       // log stall
        break;
    case USB_SIM_SUSPEND:
        fnChangeUSBState(0);
        break;
    }
}

#if defined USB_DEVICE_AVAILABLE
// The SRAM is organised as long words but only half-words are actually used and the unused half-words are skipped
//
static void fnWriteUSB_data(unsigned long *ptrInputBuffer, unsigned char *ptrDebugIn, unsigned short usLength)
{
    unsigned long ulNextEntry = 0;
    while (usLength != 0) {
        ulNextEntry = *ptrDebugIn++;
        if (usLength >= 2) {
            ulNextEntry |= (*ptrDebugIn++ << 8);
            usLength -= 2;
        }
        else {
            usLength--;
        }
        *ptrInputBuffer++ = ulNextEntry;
    }
}

static void fnReadUSB_data(unsigned long *ptrUSB_in, unsigned char *ptrOutputBuffer, unsigned short usLength)
{
    unsigned long ulNextEntry = 0;
    while (usLength != 0) {
        ulNextEntry = *ptrUSB_in++;
        *ptrOutputBuffer++ = (unsigned char)ulNextEntry;
        if (usLength >= 2) {
            *ptrOutputBuffer++ = (unsigned char)(ulNextEntry >> 8);
            usLength -= 2;
        }
        else {
            usLength--;
        }
    }
}

static void fnUSB_device_transfer_interrupt(int iEndpoint)
{
    USB_ISTR &= ~(USB_ISTR_EP_ID_MASK);
    USB_ISTR |= (iEndpoint);
    if (((USB_CNTR & USB_ISTR) & (USB_CNTR_CTRM)) != 0) {                // if correct transfer interrupt enabled and interrupt source pending
        if (0 == 1) {                                                    // isochronous or double-buffered endpoint
            if (fnGenInt(irq_USB_HP_CAN_TX_ID) != 0) {                   // if high priority USB interrupt is not disabled in core
                VECTOR_TABLE *ptrVect = (VECTOR_TABLE *)VECTOR_TABLE_OFFSET_REG;
                ptrVect->processor_interrupts.irq_USB_HP_CAN1_TX();      // call the high priority interrupt handler
            }
        }
        else {
            if (fnGenInt(irq_USB_LP_CAN_RX0_ID) != 0) {                  // if low priority USB interrupt is not disabled in core
                VECTOR_TABLE *ptrVect = (VECTOR_TABLE *)VECTOR_TABLE_OFFSET_REG;
                ptrVect->processor_interrupts.irq_USB_LP_CAN1_RX0();     // call the low priority interrupt handler
            }
        }
    }
}

static unsigned short fnExtractEndpointLength(unsigned short usUSB_COUNT_RX)
{
    unsigned short usMaxRx = ((usUSB_COUNT_RX & USB_COUNT_RX_NUM_BLOCK_MASK) >> USB_COUNT_SHIFT);
    if ((usUSB_COUNT_RX & USB_COUNT_RX_BL_SIZE) != 0) {
        usMaxRx *= 32;
        usMaxRx += 32;
    }
    else {
        usMaxRx *= 2;
    }
    return (usMaxRx);
}
#endif

// Inject USB transactions for test purposes
//
extern int fnSimulateUSB(int iDevice, int iEndPoint, unsigned char ucPID, unsigned char *ptrDebugIn, unsigned short usLenEvent)
{
    int iReset = 0;
#if defined USB_DEVICE_AVAILABLE
    if (ptrDebugIn == 0) {
        if ((usLenEvent & USB_RESET_CMD) != 0) {                         // usb reset
            memset(ucRxBank, 0, sizeof(ucRxBank));                       // default is even bank
            memset(ucTxBuffer, 0, sizeof(ucTxBuffer));                   // default is even buffer
            USB_ISTR = USB_ISTR_RESET;                                   // set reset detected interrupt flag
            USB_EP0R = USB_EP1R = USB_EP2R = USB_EP3R = USB_EP4R = USB_EP5R = USB_EP6R = USB_EP7R = 0;
            iReset = 1;
        }
        if ((usLenEvent & USB_SLEEP_CMD) != 0) {                         // usb suspend
            USB_ISTR |= USB_ISTR_SUSP;                                   // set suspend detected interrupt flag
        }
        if ((usLenEvent & USB_RESUME_CMD) != 0) {
            USB_ISTR |= USB_ISTR_WKUP;                                   // set resume detected interrupt flag
        }
        if ((usLenEvent & USB_IN_SUCCESS) != 0) {
        }
        if (((USB_CNTR & USB_ISTR) & (USB_ISTR_RESET | USB_ISTR_SUSP | USB_ISTR_WKUP)) != 0) { // if low priority interrupt enabled and interrupt source pending
            if (fnGenInt(irq_USB_LP_CAN_RX0_ID) != 0) {                      // if low priority USB interrupt is not disabled in core
                VECTOR_TABLE *ptrVect = (VECTOR_TABLE *)VECTOR_TABLE_OFFSET_REG;
                ptrVect->processor_interrupts.irq_USB_LP_CAN1_RX0();         // call the low priority interrupt handler
                if (iReset != 0) {
                }
            }
        }
    }
    else {
        volatile unsigned long *ptrEndpointControl = USB_EP0R_ADD;
        USB_BD_TABLE *ptrBD = (USB_BD_TABLE *)(USB_CAN_SRAM_ADDR + USB_BTABLE); // the start of the buffer descripter table
        if ((USB_DADDR & USB_DADDR_EF) == 0) {                           // if the function is disabled
            return 1;
        }
        if ((USB_DADDR & USB_DADDR_ADD_MASK) != (unsigned long)iDevice) { // not our device address so ignore
            if (iDevice != 0xff) {                                       // special broadcast for simulator use so that it doesn't have to know the USB address
                return 1;
            }
        }
        ptrEndpointControl += iEndPoint;
        ptrBD += iEndPoint;
        switch (ucPID) {
        case OUT_PID:
        case SETUP_PID:
            {
                unsigned short usMaxRx = fnExtractEndpointLength(ptrBD->usUSB_COUNT_RX_0);
                volatile unsigned long *ptrInputBuffer = (USB_CAN_SRAM_ADDR + USB_BTABLE);
                ptrInputBuffer += (ptrBD->usUSB_ADDR_RX/2);
                if (usLenEvent > usMaxRx) {
                    usLenEvent = usMaxRx;
                }
                fnWriteUSB_data((unsigned long *)ptrInputBuffer, ptrDebugIn, usLenEvent);
                ptrBD->usUSB_COUNT_RX_0 &= ~(USB_COUNT_COUNT_MASK);
                ptrBD->usUSB_COUNT_RX_0 |= (usLenEvent & USB_COUNT_COUNT_MASK);
                ucTxBuffer[iEndPoint] = 0;
                if ((*ptrEndpointControl & USB_EPR_CTR_STAT_RX_MASK) == USB_EPR_CTR_STAT_RX_VALID) {
                    if (ucPID == SETUP_PID) {
                        *ptrEndpointControl |= (USB_EPR_CTR_CTR_RX | USB_EPR_CTR_SETUP | USB_EPR_CTR_DTOG_TX);
                    }
                    else {
                        *ptrEndpointControl &= ~(USB_EPR_CTR_SETUP);
                        *ptrEndpointControl |= (USB_EPR_CTR_CTR_RX);
                    }
                    USB_ISTR |= (USB_CNTR_CTRM | USB_ISTR_DIR);
                }
            }
            break;
        default:
            _EXCEPTION("Unknown PID!");
            return 0;
        }
        fnUSB_device_transfer_interrupt(iEndPoint);
    }
#elif defined USB_OTG_AVAILABLE
    if (ptrDebugIn == 0) {
        if ((usLenEvent & USB_RESET_CMD) != 0) {                         // usb reset
            memset(ucRxBank,   0, sizeof(ucRxBank));                     // default is even bank
            memset(ucTxBuffer, 0, sizeof(ucTxBuffer));                   // default is even buffer
            OTG_FS_GINTSTS = (OTG_FS_GINTSTS_PTXFE | 0x00800000 | OTG_FS_GINTSTS_USBRST | OTG_FS_GINTSTS_USBSUSP | OTG_FS_GINTSTS_ESUSP | OTG_FS_GINTSTS_NPTXFE); // set reset detected interrupt flag
            iReset = 1;
        }
        if ((usLenEvent & USB_SLEEP_CMD) != 0) {                         // usb suspend
            OTG_FS_GINTSTS |= OTG_FS_GINTSTS_USBSUSP;                    // set suspend detected interrupt flag
        }
        if ((usLenEvent & USB_RESUME_CMD) != 0) {
            OTG_FS_GINTSTS |= OTG_FS_GINTSTS_WKUINT;                     // set resume detected interrupt flag
        }
        if ((usLenEvent & USB_IN_SUCCESS) != 0) {
        }
    }
    else {
        if (((OTG_FS_DCFG & OTG_FS_DCFG_DAD_MASK) >> 4) != (unsigned long)iDevice) { // not our device address so ignore
            if (iDevice != 0xff) {                                       // special broadcast for simulator use so that it doesn't have to know the USB address
                return 1;
            }
        }
        OTG_FS_GRXSTSR = ((iEndPoint & OTG_FS_GRXSTSR_EPNUM) | (usLenEvent << OTG_FS_GRXSTSR_BCNT_SHIFT)); // endpoint and length
        switch (ucPID) {
        case SETUP_PID:
            {
                volatile unsigned long *ptrFIFO = OTG_FS_DFIFO0_ADDR;
                OTG_FS_GRXSTSR |= (OTG_FS_GRXSTSR_PKTSTS_SETUP_RX | OTG_FS_GRXSTSR_DPID_DATA0); // add PID type
                ucTxBuffer[iEndPoint] = 0;
                OTG_FS_GINTSTS |= OTG_FS_GINTSTS_RXFLVL;                 // set interrupt flag
                while (usLenEvent) {
                    *ptrFIFO++ = (*ptrDebugIn | (*(ptrDebugIn + 1) << 8) | (*(ptrDebugIn + 2) << 16) | (*(ptrDebugIn + 3) << 24));
                    if (usLenEvent <= 4) {
                        break;
                    }
                    ptrDebugIn += 4;                                     // {}
                    usLenEvent -= 4;
                }
            }
            break;
        case OUT_PID:
            OTG_FS_GRXSTSR |= (OTG_FS_GRXSTSR_PKTSTS_OUT_RX);            // add PID type
            ucTxBuffer[iEndPoint] ^= 1;                                  // data toggle
            if (ucTxBuffer[iEndPoint] != 0) {
                OTG_FS_GRXSTSR |= OTG_FS_GRXSTSR_DPID_DATA1;
            }
            OTG_FS_GINTSTS |= OTG_FS_GINTSTS_RXFLVL;                     // set interrupt flag
            if (usLenEvent != 0) {
                volatile unsigned long *ptrFIFO = OTG_FS_DFIFO0_ADDR;
                while (usLenEvent) {
                    *ptrFIFO++ = (*ptrDebugIn | (*(ptrDebugIn + 1) << 8) | (*(ptrDebugIn + 2) << 16) | (*(ptrDebugIn + 3) << 24));
                    if (usLenEvent <= 4) {
                        break;
                    }
                    ptrDebugIn += 4;                                     // {}
                    usLenEvent -= 4;
                }
            }
            break;
        default:
            _EXCEPTION("Unknown PID!");
            return 0;
        }
        OTG_FS_GRXSTSP = OTG_FS_GRXSTSR;
    }
    if (OTG_FS_GINTSTS & OTG_FS_GINTMSK) {                               // if interrupt enabled
        if (OTG_FS_GAHBCFG & OTG_FS_GAHBCFG_GINTMSK) {                   // if global USB interrupts enabled
            if (IRQ64_95_SER & (1 << (irq_OTG_FS_ID - 64))) {            // if USB interrupt is not disabled in core
                VECTOR_TABLE *ptrVect = (VECTOR_TABLE *)VECTOR_TABLE_OFFSET_REG;
                ptrVect->processor_interrupts.irq_OTG_FS();              // call the interrupt handler
                if (iReset != 0) {                                       // reset is followed by ENUM if interrupt is enabled
                    OTG_FS_GINTSTS |= OTG_FS_GINTSTS_ENUMDNE;
                    if (OTG_FS_GINTMSK & OTG_FS_GINTMSK_ENUMDNEM) {
                        ptrVect->processor_interrupts.irq_OTG_FS();      // call the interrupt handler
                    }
                }
                else if (ucPID == SETUP_PID) {                           // after passing the SETUP data there is a following interrupt
                    OTG_FS_GRXSTSR &= ~(OTG_FS_GRXSTSR_BCNT_MASK | OTG_FS_GRXSTSR_PKTSTS_MASK);
                    OTG_FS_GRXSTSR |= OTG_FS_GRXSTSR_PKTSTS_SETUP_OK;    // transaction completed
                    OTG_FS_GRXSTSP  = OTG_FS_GRXSTSR;
                    OTG_FS_GINTSTS |= OTG_FS_GINTSTS_RXFLVL;
                    if (OTG_FS_GINTMSK & OTG_FS_GINTMSK_RXFLVLM) {
                        ptrVect->processor_interrupts.irq_OTG_FS();      // call the interrupt handler
                        ptrVect->processor_interrupts.irq_OTG_FS();      // the USB controller tends to generate a spurious interrupt here
                        OTG_FS_GINTSTS |= OTG_FS_GINTSTS_IEPINT;
                        OTG_FS_DIEPINT0 |= OTG_FS_DIEPINT_XFRC;
                        if (OTG_FS_GINTMSK & OTG_FS_GINTMSK_IEPINT) {
                            ptrVect->processor_interrupts.irq_OTG_FS();  // IN transfer complete
                        }
                    }
                }
                else if (ucPID == OUT_PID) {
                    ptrVect->processor_interrupts.irq_OTG_FS();          // the USB controller tends to generate a spurious interrupt here
                }
            }
        }
    }
#endif
    return 0;
}

