uTasker/uTasker-Kinetis/Hardware/STM32/STM32Sim.c
// Check whether data has been prepared for transmission
//
extern void fnCheckUSBOut(int iDevice, int iEndpoint)
{
#if defined USB_DEVICE_AVAILABLE
    volatile unsigned long *ptrEndpointControl = USB_EP0R_ADD;
    unsigned long *ptrUSB_data;
    USB_BD_TABLE *ptrBD = (USB_BD_TABLE *)(USB_CAN_SRAM_ADDR + USB_BTABLE); // the start of the buffer descripter table
    unsigned char ucTxBufferData[1024];
    ptrEndpointControl += iEndpoint;
    ptrBD += iEndpoint;
    FOREVER_LOOP() {                                                     // allow handling multiple transmissions
        switch (*ptrEndpointControl & USB_EPR_CTR_STAT_TX_MASK) {
        case USB_EPR_CTR_STAT_TX_VALID:                                  // transmission is set up
            ptrUSB_data = (unsigned long *)(USB_CAN_SRAM_ADDR + USB_BTABLE);
            ptrUSB_data += (ptrBD->usUSB_ADDR_TX / 2);
            fnReadUSB_data(ptrUSB_data, ucTxBufferData, ptrBD->usUSB_COUNT_TX_0);
            fnLogUSB(iEndpoint, 0, ptrBD->usUSB_COUNT_TX_0, ucTxBufferData, 1 /* data toggle needs to be monitored */);
            *ptrEndpointControl &= ~(USB_EPR_CTR_STAT_TX_MASK);          // disable transmitter state
            *ptrEndpointControl |= (USB_EPR_CTR_CTR_TX | USB_EPR_CTR_STAT_TX_NAK);
            USB_ISTR &= ~(USB_ISTR_DIR);
            USB_ISTR |= (USB_CNTR_CTRM);
            fnUSB_device_transfer_interrupt(iEndpoint);
            break;
        case USB_EPR_CTR_STAT_TX_STALL:
        default:
            return;
        }
    }
#elif defined USB_OTG_AVAILABLE
    unsigned short usUSBLength;
    switch (iEndpoint) {
    case 0:
        if ((OTG_FS_DIEPCTL0 & OTG_FS_DIEPCTL_EPENA) != 0) {
            usUSBLength = (unsigned short)(OTG_FS_DIEPTSIZ0 & OTG_FS_DIEPTSIZ_XFRSIZ_MASK); // length of data in FIFO
            fnLogUSB(iEndpoint, 0, usUSBLength, (unsigned char *)OTG_FS_DFIFO0_ADDR, 1 /* data toggle needs to be monitored */);
            OTG_FS_DIEPCTL0 &= ~(OTG_FS_DIEPCTL_EPENA);                  // disable the endpoint after transmission
        }
        break;
    case 1:
        if ((OTG_FS_DIEPCTL1 & OTG_FS_DIEPCTL_EPENA) != 0) {
            usUSBLength = (unsigned short)(OTG_FS_DIEPTSIZ1 & OTG_FS_DIEPTSIZ_XFRSIZ_MASK); // length of data in FIFO
            fnLogUSB(iEndpoint, 0, usUSBLength, (unsigned char *)OTG_FS_DFIFO1_ADDR, 1 /* data toggle needs to be monitored */);
            OTG_FS_DIEPCTL1 &= ~(OTG_FS_DIEPCTL_EPENA);                  // disable the endpoint after transmission
        }
        break;
    case 2:
        if ((OTG_FS_DIEPCTL2 & OTG_FS_DIEPCTL_EPENA) != 0) {
            usUSBLength = (unsigned short)(OTG_FS_DIEPTSIZ2 & OTG_FS_DIEPTSIZ_XFRSIZ_MASK); // length of data in FIFO
            fnLogUSB(iEndpoint, 0, usUSBLength, (unsigned char *)OTG_FS_DFIFO2_ADDR, 1 /* data toggle needs to be monitored */);
            OTG_FS_DIEPCTL2 &= ~(OTG_FS_DIEPCTL_EPENA);                  // disable the endpoint after transmission
        }
        break;
    case 3:
        if ((OTG_FS_DIEPCTL3 & OTG_FS_DIEPCTL_EPENA) != 0) {
            usUSBLength = (unsigned short)(OTG_FS_DIEPTSIZ3 & OTG_FS_DIEPTSIZ_XFRSIZ_MASK); // length of data in FIFO
            fnLogUSB(iEndpoint, 0, usUSBLength, (unsigned char *)OTG_FS_DFIFO3_ADDR, 1 /* data toggle needs to be monitored */);
            OTG_FS_DIEPCTL3 &= ~(OTG_FS_DIEPCTL_EPENA);                  // disable the endpoint after transmission
        }
        break;
    }
#endif
}

// Request an endpoint buffer size
//
extern unsigned short fnGetEndpointInfo(int iEndpoint)
{
    unsigned short usLength = 0;
    #if defined USB_DEVICE_AVAILABLE
    volatile unsigned long *ptrEndpointControl = USB_EP0R_ADD;
    USB_BD_TABLE *ptrBD = (USB_BD_TABLE *)(USB_CAN_SRAM_ADDR + USB_BTABLE); // the start of the buffer descripter table
    ptrEndpointControl += iEndpoint;
    ptrBD += iEndpoint;
    usLength = fnExtractEndpointLength(ptrBD->usUSB_COUNT_RX_0);
    #elif defined USB_OTG_AVAILABLE
    switch (iEndpoint) {
    case 0:
        usLength = (unsigned short)(OTG_FS_DIEPTXF0 >> 16);              // length in words
        break;
    case 1:
        usLength = (unsigned short)(OTG_FS_DIEPTXF1 >> 16);              // length in words
        break;
    case 2:
        usLength = (unsigned short)(OTG_FS_DIEPTXF2 >> 16);              // length in words
        break;
    case 3:
        usLength = (unsigned short)(OTG_FS_DIEPTXF3 >> 16);              // length in words
        break;
    }
    usLength *= 4;                                                       // length in bytes
    #endif
    return usLength;
}
#endif

#if !defined DEVICE_WITHOUT_DMA
static int fnSimulateDMA(unsigned char ucChannel, int iDMA)
{
    VECTOR_TABLE *ptrVect = (VECTOR_TABLE *)VECTOR_TABLE_OFFSET_REG;
    switch (iDMA) {
    case 1:
        break;
    #if defined DMA2_S0CR
    case 2:
        // Only channel 0 support at present!!!
        //
        if (((DMA2_S0CR >> 25) & 0x7) == ucChannel) {                    // if the channel matches the DMA setting
            DMA2_S0NDTR &= 0x0000ffff;
            if (((DMA2_S0CR & DMA_SxCR_EN) != 0) && (DMA2_S0NDTR !=  0)) { // if the channel is enabled and has a count value
                unsigned long ulData;
                switch (DMA2_S0CR & (DMA_SxCR_DIR_M2P | DMA_SxCR_DIR_M2M)) {
                case 0:                                                  // peripheral to memory
                    switch (DMA2_S0CR & (DMA_SxCR_PSIZE_32 | DMA_SxCR_PSIZE_16)) {
                    case 0:
                        ulData = *(unsigned char *)DMA2_S0PAR;           // read the byte peripheral data
                        if ((DMA2_S0CR & DMA_SxCR_PINC) != 0) {
                            DMA2_S0PAR = (DMA2_S0PAR + 1);
                        }
                        break;
                    case DMA_SxCR_PSIZE_16:
                        ulData = *(unsigned short *)DMA2_S0PAR;          // read the short word peripheral data
                        if ((DMA2_S0CR & DMA_SxCR_PINC) != 0) {
                            DMA2_S0PAR = (DMA2_S0PAR + 2);
                        }
                        break;
                    case DMA_SxCR_PSIZE_32:
                        ulData = *(unsigned long *)DMA2_S0PAR;           // read the long word peripheral data
                        if ((DMA2_S0CR & DMA_SxCR_PINC) != 0) {
                            DMA2_S0PAR = (DMA2_S0PAR + 4);
                        }
                        break;
                    }
                    switch (DMA2_S0CR & (DMA_SxCR_MSIZE_32 | DMA_SxCR_MSIZE_16)) {
                    case 0:
                        *(unsigned char *)DMA2_S0M0AR = (unsigned char)ulData; // write the byte to memory
                        if ((DMA2_S0CR & DMA_SxCR_MINC) != 0) {
                            DMA2_S0M0AR = (DMA2_S0M0AR + 1);
                        }
                        break;
                    case DMA_SxCR_MSIZE_16:
                        *(unsigned short *)DMA2_S0M0AR = (unsigned short)ulData; // write the short word to memory
                        if ((DMA2_S0CR & DMA_SxCR_MINC) != 0) {
                            DMA2_S0M0AR = (DMA2_S0M0AR + 2);
                        }
                        break;
                    case DMA_SxCR_MSIZE_32:
                        *(unsigned long *)DMA2_S0M0AR = ulData;          // write the long word to memory
                        if ((DMA2_S0CR & DMA_SxCR_MINC) != 0) {
                            DMA2_S0M0AR = (DMA2_S0M0AR + 4);
                        }
                        break;
                    }
                    break;
                case DMA_SxCR_DIR_M2P:                                   // memory to peripheral transfer
                case DMA_SxCR_DIR_M2M:                                   // memory to memory transfer
                    _EXCEPTION("To do");
                    break;
                }
                DMA2_S0NDTR = (DMA2_S0NDTR - 1);
                if (DMA2_S0NDTR == 0) {                                  // completed
                    DMA1_LISR |= (DMA_LISR_HTIF0 | DMA_LISR_TCIF0);      // set flags to indicate half and full transfer completed
                    if ((DMA2_S0CR & DMA_SxCR_TCIE) != 0) {              // if interrupt on full-buffer is enabled
                        if ((IRQ32_63_SER & (1 << (irq_DMA2_Channel1_ID - 32))) != 0) { // if DMA stream interrupt is not disabled
                            ptrVect->processor_interrupts.irq_DMA2_Stream0(); // call the interrupt handler
                        }
                    }
                }
            }
        }
        break;
    #endif
    }
    return -1;                                                           // no operation
}

static void fnHandleDMA_triggers(unsigned char ucChannel, int iDMA)
{
    switch (iDMA) {
    case 1:
        break;
    #if defined DMA2_S0CR
    case 2:
        if (((DMA2_S0CR >> 25) & 0x7) == ucChannel) {                    // if the channel matches the DMA setting
            fnSimulateDMA(ucChannel, iDMA);
        }
        break;
    #endif
    }
}
#endif

