uTasker/uTasker-Kinetis/Hardware/STM32/STM32Sim.c
#if defined SUPPORT_ADC                                                  // {10}
static unsigned short fnConvertSimADCvalue(STM32_ADC_REGS *ptrADC, unsigned short usStandardValue)
{
    switch (ptrADC->ADC_CR1 & ADC_CR1_RES_6_BIT) {
    case ADC_CR1_RES_12_BIT:                                             // conversion mode - single-ended 12 bit
        if ((ptrADC->ADC_CR2 & ADC_CR2_ALIGN_LEFT) == 0) {
            usStandardValue >>= 4;
        }
        else {
            usStandardValue &= 0xfff0;
        }
        break;
    case ADC_CR1_RES_10_BIT:                                             // conversion mode - single-ended 10 bit
        if ((ptrADC->ADC_CR2 & ADC_CR2_ALIGN_LEFT) == 0) {
            usStandardValue >>= 6;
        }
        else {
            usStandardValue &= 0xffc0;
        }
        break;
    case ADC_CR1_RES_8_BIT:                                              // conversion mode - single-ended 8 bit
        if ((ptrADC->ADC_CR2 & ADC_CR2_ALIGN_LEFT) == 0) {
            usStandardValue >>= 8;
        }
        else {
            usStandardValue &= 0xff00;
        }
        break;
    case ADC_CR1_RES_6_BIT:                                              // conversion mode - single-ended 6 bit
        if ((ptrADC->ADC_CR2 & ADC_CR2_ALIGN_LEFT) == 0) {
            usStandardValue >>= 10;
        }
        else {
            usStandardValue &= 0xfc00;
        }
        break;
    }
    return usStandardValue;
}

static void fnSimADC(int iChannel)
{
    VECTOR_TABLE *ptrVect = (VECTOR_TABLE *)VECTOR_TABLE_OFFSET_REG;
    unsigned long ulSample = 0;
    STM32_ADC_REGS *ptrADC;
    unsigned long ulValue = 0;
    unsigned long ulChannel;
    unsigned short usADCvalue;
    if (iChannel == 1) {
        ptrADC = (STM32_ADC_REGS *)ADC_BLOCK;
    }
    #if ADC_CONTROLLERS > 1
    else if (iChannel == 2) {
        ptrADC = (STM32_ADC_REGS *)(ADC_BLOCK + 0x100);
    }
    #endif
    #if ADC_CONTROLLERS > 2
    else if (iChannel == 3) {
        ptrADC = (STM32_ADC_REGS *)(ADC_BLOCK + 0x200);
    }
    #endif
    else {
        return;
    }
    if ((ptrADC->ADC_CR1 & ADC_CR1_SCAN) != 0) {                         // if scan mode is enabled
        ulValue = ((ptrADC->ADC_SQR1 & ADC_SQR1_L_MASK) >> ADC_SQR1_L_SHIFT); // the sequence length
        while (ulSample <= ulValue) {
            if (ulSample >= 12) {
                ulChannel = (ptrADC->ADC_SQR1 >> ((ulSample - 12) * 5));
            }
            else if (ulSample >= 6) {
                ulChannel = (ptrADC->ADC_SQR2 >> ((ulSample - 6) * 5));
            }
            else {
                ulChannel = (ptrADC->ADC_SQR3 >> (ulSample * 5));
            }
            ulChannel &= 0x1f;                                           // the channel being sampled
            ulSample++;
            if ((ptrADC->ADC_CR1 & ADC_CR1_AWDEN) != 0) {                // analog watchog mode enabled
                if (((ptrADC->ADC_CR1 & ADC_CR1_AWDSGL_SINGLE) == 0) || ((ptrADC->ADC_CR1 & ADC_CR1_AWDCH_MASK) == ulChannel)) { // if on all channels or this particular one only
                    if ((usADC_values[ulChannel] > ptrADC->ADC_HTR) || (usADC_values[ulChannel] < ptrADC->ADC_LTR)) { // check whether the sample value triggers the analog watchog
                        ptrADC->ADC_SR |= ADC_SR_AWD;
                        ADC_CSR |= (ADC_CSR_AWD1 << ((iChannel - 1) * 8));
                        if ((ptrADC->ADC_CR1 & ADC_CR1_AWDIE) != 0) {    // if the analog watchog interrupt is enabled
                            if ((IRQ0_31_SER & (1 << irq_ADC_ID)) != 0) {// if ADC interrupt is not disabled
                                ptrVect->processor_interrupts.irq_ADC1_2_3(); // call the interrupt handler
                            }
                        }
                    }
                }
            }
            usADCvalue = fnConvertSimADCvalue(ptrADC, usADC_values[ulChannel]); // convert the standard value to the format used by the present mode
            ptrADC->ADC_DR = usADCvalue;                                 // put the result into the regular data register
            if ((ptrADC->ADC_CR2 & ADC_CR2_DMA) != 0) {                  // if in DMA mode
    #if !defined DEVICE_WITHOUT_DMA
                fnHandleDMA_triggers(0, 2);                              // process the trigger
    #endif
            }
            else if ((ptrADC->ADC_CR2 & ADC_CR2_EOCS_CONVERSION) != 0) { // if the EOC is set after each individual conversion
                ptrADC->ADC_SR |= ADC_SR_EOC;
                ADC_CSR |= (ADC_CSR_EOC1 << ((iChannel - 1) * 8));
                if ((ptrADC->ADC_CR1 & ADC_CR1_EOCIE) != 0) {            // if the end of conversion interrupt is enabled
                    if ((IRQ0_31_SER & (1 << irq_ADC_ID)) != 0) {        // if ADC interrupt is not disabled
                        ptrVect->processor_interrupts.irq_ADC1_2_3();    // call the interrupt handler
                    }
                }
            }
        }
    }
    else {
        _EXCEPTION("To do");
    }
    if (((ptrADC->ADC_CR2 & ADC_CR2_EOCS_CONVERSION) == 0) && ((ptrADC->ADC_CR2 & ADC_CR2_DMA) == 0)) { // if the EOC is set after sequence conversion (not DMA mode)
        ptrADC->ADC_SR |= ADC_SR_EOC;
        ADC_CSR |= (ADC_CSR_EOC1 << ((iChannel - 1) * 8));
        if ((ptrADC->ADC_CR1 & ADC_CR1_EOCIE) != 0) {                    // if the end of conversion interrupt is enabled
            if ((IRQ0_31_SER & (1 << irq_ADC_ID)) != 0) {                // if ADC interrupt is not disabled
                ptrVect->processor_interrupts.irq_ADC1_2_3();            // call the interrupt handler
            }
        }
    }
    if ((ptrADC->ADC_CR2 & ADC_CR2_CONT) != 0) {
        ptrADC->ADC_CR2 |= ADC_CR2_SWSTART;                              // enable next conversion (this may not be accurate simulation but will keep it running)
    }
}

