uTasker/uTasker-Kinetis/Hardware/STM32/STM32Sim.c
static void fnTriggerADC(int iADC, int iHW_trigger)
{
    switch (iADC) {
    case 1:                                                              // ADC1
        if ((IS_POWERED_UP(APB2, RCC_APB2ENR_ADC1EN)) && ((ADC1_CR2 & ADC_CR2_ADON) != 0)) { // ADC1 powered up and operating
            if ((ADC1_CR2 & ADC_CR2_SWSTART) != 0) {                     // software trigger 
                ADC1_CR2 &= ~(ADC_CR2_SWSTART);                          // clear the start flag
                fnSimADC(1);                                             // perform ADC conversion
            }
        }
        break;
    #if ADC_CONTROLLERS > 1
    case 2:                                                              // ADC2
        if ((IS_POWERED_UP(APB2, RCC_APB2ENR_ADC2EN)) && ((ADC2_CR2 & ADC_CR2_ADON) != 0)) { // ADC2 powered up and operating
            if ((ADC2_CR2 & ADC_CR2_SWSTART) != 0) {                     // software trigger
                ADC2_CR2 &= ~(ADC_CR2_SWSTART);                          // clear the start flag
                fnSimADC(2);                                             // perform ADC conversion
            }
        }
        break;
    #endif
    #if ADC_CONTROLLERS > 2
    case 3:                                                              // ADC3
        if ((IS_POWERED_UP(APB2, RCC_APB2ENR_ADC3EN)) && ((ADC3_CR2 & ADC_CR2_ADON) != 0)) { // ADC3 powered up and operating
            if ((ADC3_CR2 & ADC_CR2_SWSTART) != 0) {                     // software trigger
                ADC3_CR2 &= ~(ADC_CR2_SWSTART);                          // clear the start flag
                fnSimADC(3);                                             // perform ADC conversion
            }
        }
        break;
    #endif
    }
}
#endif



// We can simulate timers during a tick here if required
//
extern int fnSimTimers(void)
{
    VECTOR_TABLE *ptrVect = (VECTOR_TABLE *)VECTOR_TABLE_OFFSET_REG;
    if (APPLICATION_INT_RESET_CTR_REG == (VECTKEY | SYSRESETREQ)) {      // processor reset was commanded
        return RESET_SIM_CARD;
    }
#if defined CAN_INTERFACE
    usCAN_time++;                                                        // increment CAN timestamp
    #if defined SIM_KOMODO
    fnSimCAN(0, 0, CAN_SIM_CHECK_RX);                                    // poll the CAN interface at the tick rate
    #endif
#endif
    if ((SYSTICK_CSR & SYSTICK_ENABLE) != 0) {                           // SysTick is enabled
        unsigned long ulTickCount = 0;
        if ((SYSTICK_CSR & SYSTICK_CORE_CLOCK) != 0) {
            ulTickCount = (unsigned long)((unsigned long long)((unsigned long long)TICK_RESOLUTION * (unsigned long long)HCLK)/1000000); // count per tick period from internal clock
        }
        else {
            ulTickCount = (unsigned long)((unsigned long long)((unsigned long long)TICK_RESOLUTION * (unsigned long long)HCLK)/8000000); // count per tick period from internal clock divided by 8
        }
        if (ulTickCount < SYSTICK_CURRENT) {
            SYSTICK_CURRENT -= ulTickCount;
        }
        else {
            SYSTICK_CURRENT = SYSTICK_RELOAD;
            if ((SYSTICK_CSR & SYSTICK_TICKINT) != 0) {                  // if interrupt enabled
                INT_CONT_STATE_REG |= PENDSTSET;
                if ((STM32.CORTEX_M3_REGS.ulPRIMASK & INTERRUPT_MASKED) == 0) { // if interrupt has been enabled, call interrupt handler
                    ptrVect->ptrSysTick();
                }
            }
        }
    }

    if (IWDG_KR != 0) {                                                  // watchdog is possibly operating
        static unsigned short usWatchdog = 0xfff;
        static int iWatchdogActive = 0;
        if (IWDG_KR == IWDG_KR_RETRIGGER) {                              // watchdog has been retriggered
            if (iWatchdogActive != 0) {
                IWDG_KR = 0x1234;                                        // mark as operational but not retriggered
                usWatchdog = (unsigned short)IWDG_RLR;                   // reload the count value            
            }
        }
        else {
            unsigned long ulWD_count;                                    // count per tick interval
            if (IWDG_KR == IWDG_KR_START) {
                usWatchdog = (unsigned short)IWDG_RLR;
                iWatchdogActive = 1;
            }
            switch (IWDG_PR) {
            case IWDG_PR_PRESCALE_4:
                ulWD_count = ((40 * TICK_RESOLUTION)/4000);
                break;
            case IWDG_PR_PRESCALE_8:
                ulWD_count = ((40000000/8)/TICK_RESOLUTION);
                break;
            case IWDG_PR_PRESCALE_16:
                ulWD_count = ((40000000/16)/TICK_RESOLUTION);
                break;
            case IWDG_PR_PRESCALE_32:
                ulWD_count = ((40 * TICK_RESOLUTION)/32000);
                break;
            case IWDG_PR_PRESCALE_64:
                ulWD_count = ((40000000/64)/TICK_RESOLUTION);
                break;
            case IWDG_PR_PRESCALE_128:
                ulWD_count = ((40000000/128)/TICK_RESOLUTION);
                break;
            case IWDG_PR_PRESCALE_256:
            default:
                ulWD_count = ((40000000/256)/TICK_RESOLUTION);
                break;
            }
            if (ulWD_count >= usWatchdog) {
                return RESET_CARD_WATCHDOG;
            }
            else {
                usWatchdog -= (unsigned short)ulWD_count;                // counting down
            }
        }
    }
#if defined SUPPORT_RTC                                                  // {1}
    #if defined _STM32F2XX || defined _STM32F4XX || defined _STM32F7XX
    if (RCC_BDCR & RCC_BDCR_RTCEN) {                                     // if RTC is enabled
        if (!(RTC_ISR & (RTC_ISR_INIT))) {                               // if not in initialisation mode
            static unsigned long _RTC_SSR = 0;
            unsigned long ulSubSecondCnt = (((32768/(unsigned short)((RTC_PRER & 0x7fff) + 1)) * (TICK_RESOLUTION/1000))/10); // sub-second increments in the tick period
            int iSecondCount = 0;
            if (_RTC_SSR >= ulSubSecondCnt) {
                _RTC_SSR -= ulSubSecondCnt;                              // the sub-second value decrements
                if (_RTC_SSR == 0) {
                    iSecondCount = 1;
                }
            }
            else {
                if (_RTC_SSR != 0) {
                    iSecondCount = 1;
                }
                _RTC_SSR = ((_RTC_SSR + ((32768/(unsigned short)((RTC_PRER & 0x7fff) + 1)) * 100)) - ulSubSecondCnt);
            }
            RTC_SSR = (_RTC_SSR / 100);
            if (iSecondCount != 0) {                                     // increment the RTC time
                if ((RTC_TR & RTC_TR_SU) == 9) {
                    unsigned long ulIncrement;
                    RTC_TR &= ~(RTC_TR_SU);                              // overflow seconds
                    ulIncrement = ((RTC_TR & RTC_TR_ST) >> 4);           // tens of seconds
                    RTC_TR &= ~(RTC_TR_ST);                              // clear tens of seconds
                    if (ulIncrement == 5) {                              // tens of seconds overflow
                        ulIncrement = ((RTC_TR & RTC_TR_MNU) >> 8);      // minutes
                        RTC_TR &= ~(RTC_TR_MNU);                         // clear minutes
                        if (ulIncrement == 9) {                          // overflow minutes
                            ulIncrement = ((RTC_TR & RTC_TR_MNT) >> 12); // tens of minutes
                            RTC_TR &= ~(RTC_TR_MNT);                     // clear tens of minutes
                            if (ulIncrement == 5) {                      // overflow tens of minutes
                                ulIncrement = ((RTC_TR & RTC_TR_HT) >> 20); // tens of hours
                                ulIncrement *= 10;
                                ulIncrement |= ((RTC_TR & RTC_TR_HU) >> 16); // hours
                                RTC_TR &= ~(RTC_TR_HT | RTC_TR_HU);      // clear hours
                                ulIncrement++;
                                if (ulIncrement == 24) {                 // overflow day
                                    // Simulation doesn't handle beyond days
                                    //
                                }
                                else {
                                    if (ulIncrement > 10) {
                                        if (ulIncrement > 20) {
                                            ulIncrement -= 20;
                                            ulIncrement |= (2 << 4);
                                        }
                                        else {
                                            ulIncrement -= 10;
                                            ulIncrement |= (1 << 4);
                                        }
                                    }
                                    ulIncrement <<= 16;
                                    RTC_TR |= ulIncrement;
                                }
                            }
                            else {
                                ulIncrement++;
                                ulIncrement <<= 12;
                                RTC_TR |= ulIncrement;
                            }
                        }
                        else {
                            ulIncrement++;
                            ulIncrement <<= 8;
                            RTC_TR |= ulIncrement;
                        }
                    }
                    else {
                        ulIncrement++;
                        ulIncrement <<= 4;
                        RTC_TR |= ulIncrement;
                    }
                }
                else {
                    RTC_TR = (RTC_TR + 1);
                }
            }
        }
    }
    #endif
#endif
#if defined SUPPORT_TIMER 
    if (((RCC_APB1ENR & RCC_APB1ENR_TIM2EN) != 0) && ((TIM2_CR1 & TIM_CR1_CEN) != 0)) { // timer 2 is enabled
        unsigned long ulTickCount = ((TICK_RESOLUTION/1000) * ((PCLK1 * 2)/1000)); // count per tick period with no prescaler
        ulTickCount /= (TIM2_PSC + 1);                                   // respect the prescaler
        TIM2_CNT += ulTickCount;
        if (TIM2_CNT >= TIM2_ARR) {
            TIM2_CNT = 0;
            TIM2_SR |= TIM_SR_UIF;
            if (TIM2_CR1 & TIM_CR1_OPM) {                                // single-shot mode
                TIM2_CR1 = 0;                                            // automatically disable further operation
            }
            if ((TIM2_DIER & TIM_DIER_UIE) != 0) {                       // overflow interrupt enabled
                if ((IRQ0_31_SER & (1 << irq_TIM2_ID)) != 0) {           // if TIM2 interrupt is not disabled
                    ptrVect->processor_interrupts.irq_TIM2();            // call the interrupt handler
                }
            }
        }
        TIM2_CNT &= 0xffff;
    }

    if (((RCC_APB1ENR & RCC_APB1ENR_TIM3EN) != 0) && ((TIM3_CR1 & TIM_CR1_CEN) != 0)) { // timer 3 is enabled
        unsigned long ulTickCount = ((TICK_RESOLUTION/1000) * ((PCLK1 * 2)/1000)); // count per tick period with no prescaler
        ulTickCount /= (TIM3_PSC + 1);                                   // respect the prescaler
        TIM3_CNT += ulTickCount;
        if (TIM3_CNT >= TIM3_ARR) {
            TIM3_CNT = 0;
            TIM3_SR |= TIM_SR_UIF;
            if ((TIM3_CR1 & TIM_CR1_OPM) != 0) {                         // single-shot mode
                TIM3_CR1 = 0;                                            // automatically disable further operation
            }
            if ((TIM3_DIER & TIM_DIER_UIE) != 0) {                       // overflow interrupt enabled
                if ((IRQ0_31_SER & (1 << irq_TIM3_ID)) != 0) {           // if TIM3 interrupt is not disabled
                    ptrVect->processor_interrupts.irq_TIM3();            // call the interrupt handler
                }
            }
        }
        TIM3_CNT &= 0xffff;
    }

    if (((RCC_APB1ENR & RCC_APB1ENR_TIM4EN) != 0) && ((TIM4_CR1 & TIM_CR1_CEN) != 0)) { // timer 4 is enabled
        unsigned long ulTickCount = ((TICK_RESOLUTION/1000) * ((PCLK1 * 2)/1000)); // count per tick period with no prescaler
        ulTickCount /= (TIM4_PSC + 1);                                   // respect the prescaler
        TIM4_CNT += ulTickCount;
        if (TIM4_CNT >= TIM4_ARR) {
            TIM4_CNT = 0;
            TIM4_SR |= TIM_SR_UIF;
            if (TIM4_CR1 & TIM_CR1_OPM) {                                // single-shot mode
                TIM4_CR1 = 0;                                            // automatically disable further operation
            }
            if (TIM4_DIER & TIM_DIER_UIE) {                              // overflow interrupt enabled
                if (IRQ0_31_SER & (1 << irq_TIM4_ID)) {                  // if TIM4 interrupt is not disabled
                    ptrVect->processor_interrupts.irq_TIM4();            // call the interrupt handler
                }
            }
        }
        TIM4_CNT &= 0xffff;
    }

