uTasker/uTasker-Kinetis/Hardware/STM32/STM32Sim.c
    if (((RCC_APB1ENR & RCC_APB1ENR_TIM5EN) != 0) && ((TIM5_CR1 & TIM_CR1_CEN) != 0)) { // timer 5 is enabled
        unsigned long ulTickCount = ((TICK_RESOLUTION/1000) * ((PCLK1 * 2)/1000)); // count per tick period with no prescaler
        ulTickCount /= (TIM5_PSC + 1);                                   // respect the prescaler
        TIM5_CNT += ulTickCount;
        if (TIM5_CNT >= TIM5_ARR) {
            TIM5_CNT = 0;
            TIM5_SR |= TIM_SR_UIF;
            if (TIM5_CR1 & TIM_CR1_OPM) {                                // single-shot mode
                TIM5_CR1 = 0;                                            // automatically disable further operation
            }
            if (TIM5_DIER & TIM_DIER_UIE) {                              // overflow interrupt enabled
                if (IRQ32_63_SER & (1 << (irq_TIM5_ID - 32))) {          // if TIM5 interrupt is not disabled
                    ptrVect->processor_interrupts.irq_TIM5();            // call the interrupt handler
                }
            }
        }
        TIM5_CNT &= 0xffff;
    }

    #if defined TIMER_9_AVAILABLE
    if (((RCC_APB2ENR & RCC_APB2ENR_TIM9EN) != 0) && ((TIM9_CR1 & TIM_CR1_CEN) != 0)) { // timer 10 is enabled
        unsigned long ulTickCount = ((TICK_RESOLUTION/1000) * ((PCLK2 * 2)/1000)); // count per tick period with no prescaler
        ulTickCount /= (TIM9_PSC + 1);                                   // respect the prescaler
        TIM9_CNT += ulTickCount;
        if (TIM9_CNT >= TIM10_ARR) {
            TIM9_CNT = 0;
            TIM9_SR |= TIM_SR_UIF;
            if (TIM9_CR1 & TIM_CR1_OPM) {                                // single-shot mode
                TIM9_CR1 = 0;                                            // automatically disable further operation
            }
            if (TIM9_DIER & TIM_DIER_UIE) {                              // overflow interrupt enabled
                if (IRQ0_31_SER & (1 << (irq_TIM1_BRK_TIM9_ID))) {       // if TIM9 interrupt is not disabled
                    ptrVect->processor_interrupts.irq_TIM1_BRK_TIM9();   // call the interrupt handler
                }
            }
        }
        TIM9_CNT &= 0xffff;
    }
    #endif
    #if defined TIMER_10_AVAILABLE
    if (((RCC_APB2ENR & RCC_APB2ENR_TIM10EN) != 0) && ((TIM10_CR1 & TIM_CR1_CEN) != 0)) { // timer 10 is enabled
        unsigned long ulTickCount = ((TICK_RESOLUTION/1000) * ((PCLK2 * 2)/1000)); // count per tick period with no prescaler
        ulTickCount /= (TIM10_PSC + 1);                                  // respect the prescaler
        TIM10_CNT += ulTickCount;
        if (TIM10_CNT >= TIM10_ARR) {
            TIM10_CNT = 0;
            TIM10_SR |= TIM_SR_UIF;
            if (TIM10_CR1 & TIM_CR1_OPM) {                               // single-shot mode
                TIM10_CR1 = 0;                                           // automatically disable further operation
            }
            if (TIM10_DIER & TIM_DIER_UIE) {                             // overflow interrupt enabled
                if (IRQ0_31_SER & (1 << (irq_TIM1_UP_TIM10_ID))) {       // if TIM10 interrupt is not disabled
                    ptrVect->processor_interrupts.irq_TIM1_UP_TIM10();   // call the interrupt handler
                }
            }
        }
        TIM10_CNT &= 0xffff;
    }
    #endif
    #if defined TIMER_11_AVAILABLE
    if ((RCC_APB2ENR & RCC_APB2ENR_TIM11EN) && (TIM11_CR1 & TIM_CR1_CEN)) { // timer 11 is enabled
        unsigned long ulTickCount = ((TICK_RESOLUTION/1000) * ((PCLK2 * 2)/1000)); // count per tick period with no prescaler
        ulTickCount /= (TIM11_PSC + 1);                                  // respect the prescaler
        TIM11_CNT += ulTickCount;
        if (TIM11_CNT >= TIM10_ARR) {
            TIM11_CNT = 0;
            TIM11_SR |= TIM_SR_UIF;
            if (TIM11_CR1 & TIM_CR1_OPM) {                               // single-shot mode
                TIM11_CR1 = 0;                                           // automatically disable further operation
            }
            if (TIM11_DIER & TIM_DIER_UIE) {                             // overflow interrupt enabled
                if (IRQ0_31_SER & (1 << (irq_TIM1_TRG_COM_TIM11_ID))) {  // if TIM10 interrupt is not disabled
                    ptrVect->processor_interrupts.irq_TIM1_TRG_COM_TIM11(); // call the interrupt handler
                }
            }
        }
        TIM11_CNT &= 0xffff;
    }
    #endif
    #if defined TIMER_12_AVAILABLE
    if ((RCC_APB1ENR & RCC_APB1ENR_TIM12EN) && (TIM12_CR1 & TIM_CR1_CEN)) { // timer 13 is enabled
        unsigned long ulTickCount = ((TICK_RESOLUTION/1000) * ((PCLK1 * 2)/1000)); // count per tick period with no prescaler
        ulTickCount /= (TIM12_PSC + 1);                                  // respect the prescaler
        TIM12_CNT += ulTickCount;
        if (TIM12_CNT >= TIM10_ARR) {
            TIM12_CNT = 0;
            TIM12_SR |= TIM_SR_UIF;
            if (TIM12_CR1 & TIM_CR1_OPM) {                               // single-shot mode
                TIM12_CR1 = 0;                                           // automatically disable further operation
            }
            if (TIM12_DIER & TIM_DIER_UIE) {                             // overflow interrupt enabled
                if (IRQ32_63_SER & (1 << (irq_TIM8_BRK_TIM12_ID - 32))) {// if TIM12 interrupt is not disabled
                    ptrVect->processor_interrupts.irq_TIM8_BRK_TIM12();  // call the interrupt handler
                }
            }
        }
        TIM12_CNT &= 0xffff;
    }
    #endif
    #if defined TIMER_13_AVAILABLE
    if ((RCC_APB1ENR & RCC_APB1ENR_TIM13EN) && (TIM13_CR1 & TIM_CR1_CEN)) { // timer 13 is enabled
        unsigned long ulTickCount = ((TICK_RESOLUTION/1000) * ((PCLK1 * 2)/1000)); // count per tick period with no prescaler
        ulTickCount /= (TIM13_PSC + 1);                                  // respect the prescaler
        TIM13_CNT += ulTickCount;
        if (TIM13_CNT >= TIM10_ARR) {
            TIM13_CNT = 0;
            TIM13_SR |= TIM_SR_UIF;
            if (TIM13_CR1 & TIM_CR1_OPM) {                               // single-shot mode
                TIM13_CR1 = 0;                                           // automatically disable further operation
            }
            if (TIM13_DIER & TIM_DIER_UIE) {                             // overflow interrupt enabled
                if (IRQ32_63_SER & (1 << (irq_TIM8_UP_TIM13_ID - 32))) { // if TIM10 interrupt is not disabled
                    ptrVect->processor_interrupts.irq_TIM8_UP_TIM13(); // call the interrupt handler
                }
            }
        }
        TIM13_CNT &= 0xffff;
    }
    #endif
    #if defined TIMER_14_AVAILABLE
    if ((RCC_APB1ENR & RCC_APB1ENR_TIM14EN) && (TIM14_CR1 & TIM_CR1_CEN)) { // timer 14 is enabled
        unsigned long ulTickCount = ((TICK_RESOLUTION/1000) * ((PCLK1 * 2)/1000)); // count per tick period with no prescaler
        ulTickCount /= (TIM14_PSC + 1);                                  // respect the prescaler
        TIM14_CNT += ulTickCount;
        if (TIM14_CNT >= TIM10_ARR) {
            TIM14_CNT = 0;
            TIM14_SR |= TIM_SR_UIF;
            if (TIM14_CR1 & TIM_CR1_OPM) {                               // single-shot mode
                TIM14_CR1 = 0;                                           // automatically disable further operation
            }
            if (TIM14_DIER & TIM_DIER_UIE) {                             // overflow interrupt enabled
                if (IRQ32_63_SER & (1 << (irq_TIM8_TRG_COM_TIM14_ID - 32))) { // if TIM10 interrupt is not disabled
                    ptrVect->processor_interrupts.irq_TIM8_TRG_COM_TIM14(); // call the interrupt handler
                }
            }
        }
        TIM14_CNT &= 0xffff;
    }
    #endif
#endif
#if defined SUPPORT_ADC                                                  // {10}
    fnTriggerADC(1, 0);                                                  // handle software triggered ADC1
    #if ADC_CONTROLLERS > 1
    fnTriggerADC(2, 0);                                                  // handle software triggered ADC2
    #endif
    #if ADC_CONTROLLERS > 2
    fnTriggerADC(3, 0);                                                  // handle software triggered ADC3
    #endif
#endif
    return 0;
}

#if defined SUPPORT_RTC

