uTasker/uTasker-Kinetis/Hardware/STM32/STM32Sim.c
#define NTP_TO_1970_TIME 2208988800u
#define LEAP_YEAR(year) ((year%4)==0)                                    // valid from 1970 to 2038
static const unsigned char monthDays[]={31,28,31,30,31,30,31,31,30,31,30,31};
// Synchronise the internal RTC to the PC time when simulating
//
extern void fnInitInternalRTC(char *argv[])
{
#if defined _STM32F2XX || defined _STM32F4XX || defined _STM32F7XX
    unsigned long ulRegister;
#endif
    unsigned short *ptrShort = (unsigned short *)*argv;
    unsigned short RTC_YEAR, RTC_MONTH, RTC_DOW, RTC_DOM, RTC_HOUR, RTC_MIN, RTC_SEC;
    unsigned short usMonth;
    unsigned long ulStartTime;
    unsigned long ulLeapYears = 1970;

    RTC_YEAR = *ptrShort++;
    RTC_MONTH = *ptrShort++;
    RTC_DOW = *ptrShort++;
    RTC_DOM = *ptrShort++;
    RTC_HOUR = *ptrShort++;
    RTC_MIN = *ptrShort++;
    RTC_SEC = *ptrShort++;

    usMonth = RTC_MONTH;

    ulStartTime = ((RTC_YEAR - 1970) * 365);                             // years since reference time, represented in days without respecting leap years
    while (ulLeapYears < RTC_YEAR) {
        if (LEAP_YEAR(ulLeapYears)) {                                    // count leap years
            if (ulLeapYears == RTC_YEAR) {                               // presently in a leap year
                if ((usMonth > 2) || (RTC_DOM > 28)) {                   // past February 28 so count extra leap day in this year
                    ulStartTime++;
                }
            }
            else {
                ulStartTime++;                                           // count extra days in passed leap years
            }
        }
        ulLeapYears++;
    }
    while (--usMonth != 0) {
        ulStartTime += monthDays[RTC_MONTH];                             // add past days of previous months of this year
    }
    ulStartTime += (RTC_DOM - 1);                                        // add past number of days in present month
    ulStartTime *= 24;                                                   // convert days to hours
    ulStartTime += RTC_HOUR;                                             // add hours passed in present day
    ulStartTime *= 60;                                                   // convert hours to minutes
    ulStartTime += RTC_MIN;                                              // add minutes in present hour
    ulStartTime *= 60;                                                   // convert minutes to seconds
    ulStartTime += RTC_SEC;                                              // add seconds in present minute

#if defined _STM32F2XX || defined _STM32F4XX || defined _STM32F7XX       // {1}
    ulRegister  = (RTC_SEC%10);
    ulRegister |= ((RTC_SEC/10) << 4);
    ulRegister |= ((RTC_MIN%10) << 8);
    ulRegister |= ((RTC_MIN/10) << 12);
    ulRegister |= ((RTC_HOUR%10) << 16);
    ulRegister |= ((RTC_HOUR/10) << 20);
    RTC_TR = ulRegister;

    ulRegister  = (RTC_DOM%10);
    ulRegister |= ((RTC_DOM/10) << 4);
    ulRegister |= ((RTC_MONTH%10) << 8);
    ulRegister |= ((RTC_MONTH/10) << 12);
    ulRegister |= (RTC_DOW << 13);
    ulRegister |= (((RTC_YEAR - 2000)%10) << 16);
    ulRegister |= (((RTC_YEAR - 2000)/10) << 20);
    RTC_DR = ulRegister;

    RTC_ISR = RTC_ISR_INITS;                                             // initialised
    RTC_PRER = ((((32768/512) - 1) << RTC_PRER_ASYN_SHIFT) | ((512 - 1))); // assume programmed for 32kHz external oscillator
    RCC_BDCR = RCC_BDCR_RTCEN;
#else
    RTC_CNTL = (unsigned short)ulStartTime;                              // set the initial seconds count value (since 1970)
    RTC_CNTH = (unsigned short)(ulStartTime >> 16);
#endif
}
#endif

#if defined SUPPORT_TOUCH_SCREEN && defined MB785_GLCD_MODE
extern void fnSTMPE811(int iX, int iY);

extern void fnPenPressed(int iX, int iY)
{
    fnSTMPE811(iX, iY);
    fnSimulateInputChange(PORT_EXT_TOUCH_IRQ_PORT, (15 - PORT_EXT_TOUCH_IRQ_PORT_BIT), CLEAR_INPUT);
}

extern void fnPenMoved(int iX, int iY)
{
    fnSTMPE811(iX, iY);
}

extern void fnPenLifted(void)
{
    fnSTMPE811(-1, -1);
    fnSimulateInputChange(PORT_EXT_TOUCH_IRQ_PORT, (15 - PORT_EXT_TOUCH_IRQ_PORT_BIT), CLEAR_INPUT);
}
#endif


#if defined CAN_INTERFACE
static int iLastTxBuffer;

typedef struct stTCP_MESSAGE                                             // definition of a data frame structure
{
  //TCP_HEADER     tTCP_Header;                                          // reserve header space
    unsigned char  ucTCP_Message[50];                                    // space for content
} TCP_MESSAGE;

#define SIM_CAN_TX_OK           0
#define SIM_CAN_TX_REMOTE_OK    1
#define SIM_CAN_TX_FAIL         2
#define SIM_CAN_TX_REMOTE_FAIL  3
#define SIM_CAN_RX_READY        4



    #if !defined _LOCAL_SIMULATION && defined SIM_KOMODO
// Komodo has received something on the CAN bus
//
static void fnCAN_reception(int iChannel, unsigned char ucDataLength, unsigned char *ptrData, unsigned long ulId, int iExtendedAddress, int iRemodeRequest, unsigned short usTimeStamp, Komodo km)
{
    static CAN_MAILBOX RxMailboxFIFO[NUMBER_OF_CAN_INTERFACES][2][2] = {{{0}}}; // additional message FIFO space

    int i;
    VECTOR_TABLE *ptrVect = (VECTOR_TABLE *)VECTOR_TABLE_OFFSET_REG;
    STM_CAN_CONTROL *ptrCAN_control;
    CAN_MAILBOX *ptrRxMailbox;
    unsigned long *ptrFilters = CAN1_F0R1_ADDR;
    unsigned long *ptrFilterEnd = CAN1_F0R1_ADDR;
    if ((ucDataLength == 0) && (iRemodeRequest == 0)) {
        return;                                                          // ignore when reception without data
    }
    if (iChannel == 0) {
        ptrCAN_control = (STM_CAN_CONTROL *)CAN1_BLOCK;
        ptrRxMailbox = ADDR_CAN1_MAILBOX_0_RX;                           // the first of 2 receive mailboxes
        ptrFilterEnd += (((CAN1_FMR & CAN_FMR_CAN2SB_MASK) >> CAN_FMR_CAN2SB_SHIFT) * 2);
        i = 0;                                                           // start in first half of filter table
    }
    else {
        ptrCAN_control = (STM_CAN_CONTROL *)CAN2_BLOCK;
        ptrRxMailbox = ADDR_CAN2_MAILBOX_0_RX;                           // the first of 2 receive mailboxes
        ptrFilterEnd += (NUMBER_CAN_RX_FILTERS * 2);
        i = ((CAN1_FMR & CAN_FMR_CAN2SB_MASK) >> CAN_FMR_CAN2SB_SHIFT);  // start in the second half fo the filter table
        ptrFilters += (((CAN1_FMR & CAN_FMR_CAN2SB_MASK) >> CAN_FMR_CAN2SB_SHIFT) * 2);
    }

    if (iExtendedAddress == 0) {
        ulId <<= CAN_RIR_STID_SHIFT;
        ulId &= CAN_RIR_STID_MASK;
    }
    else {
        ulId <<= CAN_RIR_EXID_SHIFT;
        ulId &= CAN_RIR_EXID_MASK;
        ulId |= CAN_RIR_IDE;
    }
    if (iRemodeRequest != 0) {
        ulId |= CAN_RIR_RTR;
    }
    while (ptrFilters < ptrFilterEnd) {                                  // search for a filter matching this ID
        if (CAN1_FA1R & (CAN_FA1R_FACT0ON << i)) {                       // if the filter is active
            if (CAN1_FM1R & (CAN_FM1R_FBM0_LIST_MODE << i)) {            // list mode (not supported
            }
            else {                                                       // mask mode
                if ((ulId & *(ptrFilters + 1)) == (*ptrFilters & *(ptrFilters + 1))) { // check whether the filter matches
                    break;                                               // match found
                }
            }
        }
        i++;
        ptrFilters += 2;
    }
    if (ptrFilters < ptrFilterEnd) {                                     // match found
        if (CAN1_FFA1R & (CAN_FFA1R_FFA0_FIFO1 << i)) {                  // if the filter uses FIFO 1
            if ((ptrCAN_control->CAN_RF1R & CAN_RFR_FMP_MASK) < 3) {     // room in the FIFO
                if ((ptrCAN_control->CAN_RF1R & CAN_RFR_FMP_MASK) == 0) {// first message in the FIFO
                    ptrRxMailbox++;
                }
                else {                                                   // else put in FIFO queue
                    ptrRxMailbox = &RxMailboxFIFO[iChannel][1][(ptrCAN_control->CAN_RF1R & CAN_RFR_FMP_MASK) - 1];
                }
                ptrRxMailbox->CAN_TIR = ulId;
                ptrRxMailbox->CAN_TDTR = ((((i - 1)/2) << 8) & CAN_RDTR_FMI_MASK) + (ucDataLength & CAN_RDTR_DLC_MASK); // the filter number assumes that all are used in 32 bit mask mode and the FIFO use alternates 0,1,0,1,..
                if (ptrCAN_control->CAN_MCR & CAN_MCR_TTCM) {            // if time stamp enabled
                    ptrRxMailbox->CAN_TDTR |= (usCAN_time << 16);
                }
                if (ptrData != 0) {
                    ptrRxMailbox->CAN_TDLR = *ptrData++;
                    ptrRxMailbox->CAN_TDLR |= (unsigned char)(*ptrData++ << 8);
                    ptrRxMailbox->CAN_TDLR |= (unsigned char)(*ptrData++ << 16);
                    ptrRxMailbox->CAN_TDLR |= (unsigned char)(*ptrData++ << 24);
                    ptrRxMailbox->CAN_TDHR = *ptrData++;
                    ptrRxMailbox->CAN_TDHR |= (unsigned char)(*ptrData++ << 8);
                    ptrRxMailbox->CAN_TDHR |= (unsigned char)(*ptrData++ << 16);
                    ptrRxMailbox->CAN_TDHR |= (unsigned char)(*ptrData++ << 24);
                }
                ptrCAN_control->CAN_RF1R++;                              // new FIFO depth
                if (ptrCAN_control->CAN_RF1R == 3) {
                    ptrCAN_control->CAN_RF1R |= CAN_RFR_FULL;            // FIFO is full
                }
                if (ptrCAN_control->CAN_IER & CAN_IER_FMPIE1) {          // if FIFO 1 interrupt is enabled
                    if (iChannel != 0) {
                        if (IRQ64_95_SER & (1 << (irq_CAN2_RX1_ID - 65))) { // if CAN 2 Rx FIFO 1 interrupt is not disabled
                            ptrVect->processor_interrupts.irq_CAN2_RX1();// call the interrupt handler
                        }
                    }
                    else {
                        if (IRQ0_31_SER & (1 << irq_CAN1_RX1_ID)) {      // if CAN 1  Rx FIFO 1 interrupt is not disabled
                            ptrVect->processor_interrupts.irq_CAN1_RX1();// call the interrupt handler
                        }
                    }
                    if (ptrCAN_control->CAN_RF1R & CAN_RFR_RFOM) {       // the user has released the FIFO
                        ptrCAN_control->CAN_RF1R &= ~(CAN_RFR_RFOM);
                        ptrCAN_control->CAN_RF1R--;
                    }
                }
            }
            else {
                ptrCAN_control->CAN_RF1R |= CAN_RFR_FOVR;                // FIFO overrun
            }
        }
        else {                                                           // the filter uses FIFO 0
            if ((ptrCAN_control->CAN_RF0R & CAN_RFR_FMP_MASK) < 3) {     // room in the FIFO
                if ((ptrCAN_control->CAN_RF0R & CAN_RFR_FMP_MASK) != 0) {// not first message in the FIFO                                                 
                    ptrRxMailbox = &RxMailboxFIFO[iChannel][0][(ptrCAN_control->CAN_RF0R & CAN_RFR_FMP_MASK) - 1]; // so put in FIFO queue
                }
                ptrRxMailbox->CAN_TIR = ulId;
                ptrRxMailbox->CAN_TDTR = ((((i - 1)/2) << 8) & CAN_RDTR_FMI_MASK) + (ucDataLength & CAN_RDTR_DLC_MASK); // the filter number assumes that all are used in 32 bit mask mode and the FIFO use alternates 0,1,0,1,..
                if (ptrCAN_control->CAN_MCR & CAN_MCR_TTCM) {            // if time stamp enabled
                    ptrRxMailbox->CAN_TDTR |= (usCAN_time << 16);
                }
                if (ptrData != 0) {
                    ptrRxMailbox->CAN_TDLR = *ptrData++;
                    ptrRxMailbox->CAN_TDLR |= (*ptrData++ << 8);
                    ptrRxMailbox->CAN_TDLR |= (*ptrData++ << 16);
                    ptrRxMailbox->CAN_TDLR |= (*ptrData++ << 24);
                    ptrRxMailbox->CAN_TDHR = *ptrData++;
                    ptrRxMailbox->CAN_TDHR |= (*ptrData++ << 8);
                    ptrRxMailbox->CAN_TDHR |= (*ptrData++ << 16);
                    ptrRxMailbox->CAN_TDHR |= (*ptrData++ << 24);
                }
                ptrCAN_control->CAN_RF0R++;                              // new FIFO depth
                if (ptrCAN_control->CAN_RF0R == 3) {
                    ptrCAN_control->CAN_RF0R |= CAN_RFR_FULL;            // FIFO is full
                }
                if (ptrCAN_control->CAN_IER & CAN_IER_FMPIE0) {          // if FIFO 0 interrupt is enabled
                    if (iChannel != 0) {
                        if (IRQ64_95_SER & (1 << (irq_CAN2_RX0_ID - 64))) { // if CAN 2  Rx FIFO 0 interrupt is not disabled
                            ptrVect->processor_interrupts.irq_CAN2_RX0();// call the interrupt handler
                        }
                    }
                    else {
                        if (IRQ0_31_SER & (1 << irq_CAN1_RX0_ID)) {      // if CAN 1  Rx FIFO 0 interrupt is not disabled
                            ptrVect->processor_interrupts.irq_CAN1_RX0();// call the interrupt handler
                        }
                    }
                    if (ptrCAN_control->CAN_RF0R & CAN_RFR_RFOM) {       // the user has released the FIFO
                        ptrCAN_control->CAN_RF0R &= ~(CAN_RFR_RFOM);
                        ptrCAN_control->CAN_RF0R--;
                    }
                }
            }
            else {
                ptrCAN_control->CAN_RF0R |= CAN_RFR_FOVR;                // FIFO overrun
            }

