uTasker/uTasker-Kinetis/Hardware/STM32/STM32Sim.c
        }
    }
}
    #endif

extern void fnSimCAN(int iChannel, int iBufferNumber, int iSpecial)
{
    VECTOR_TABLE *ptrVect = (VECTOR_TABLE *)VECTOR_TABLE_OFFSET_REG;
    CAN_MAILBOX *ptrMailbox;
    STM_CAN_CONTROL *ptrCAN_control;
    #ifndef _LOCAL_SIMULATION
        #if defined USE_TELNET && defined UTASKER_SIM
    unsigned short usTxDataLength;
    TCP_MESSAGE tcp_message;
        #elif defined SIM_KOMODO
    unsigned char ucTxDataLength;
    static Komodo km = -1;
        #endif
    #endif

    #if defined SIM_KOMODO
    if (CAN_SIM_CHECK_RX == iSpecial) {
        u08 data_in[8];
        km_can_packet_t pkt;
        km_can_info_t   info;
        pkt.remote_req  = 0;
        pkt.extend_addr = 0;
        pkt.dlc         = 8;
        pkt.id          = 0xff;                                          // promiscuous

        if (km < 0) {
            return;
        }
        while ((km_can_read(km, &info, &pkt, 8, data_in)) >= 0) {        // has something been received?
            fnCAN_reception(info.channel, pkt.dlc, data_in, pkt.id, pkt.extend_addr, pkt.remote_req, (unsigned short)(info.timestamp), km);
        }
        return;
    }
    else if (CAN_SIM_TERMINATE == iSpecial) {
        if (km < 0) {
            return;
        }
        km_disable(km);
        km_close(KOMODO_USB_PORT);
        return;
    }
    #endif
    if (iChannel == 0) {
        ptrCAN_control = (STM_CAN_CONTROL *)CAN1_BLOCK;
        ptrMailbox = ADDR_CAN1_MAILBOX_TX;                               // the first of 3 transmit mailboxes
    }
    else {
        ptrCAN_control = (STM_CAN_CONTROL *)CAN2_BLOCK;
        ptrMailbox = ADDR_CAN2_MAILBOX_TX;                               // the first of 3 transmit mailboxes
    }

    // Configuration changes
    //
    if (ptrCAN_control->CAN_MSR & (CAN_MSR_INAK | CAN_MSR_SLAK)) {       // in sleep or initialisation modes
        return;                                                          // off so don't do anything
    }

    #if defined USE_TELNET && defined UTASKER_SIM
    if (SimSocket == -1) {
        #if defined IMMEDIATE_MEMORY_ALLOCATION                          // {17} extra parameter for tx buffer size to immediately allocate (uses default size)
        SimSocket = fnStartTelnet(usSimPort, 0xffff, 0, 0, 0, fnCANListener);
        #else
        SimSocket = fnStartTelnet(usSimPort, 0xffff, 0, 0, fnCANListener);
        #endif
        fnTelnet(SimSocket, TELNET_RAW_MODE);                            // set to RAW operating mode
        fnTCP_Connect(SimSocket, ucSimIP, usSimPort, 0, 0);              // attempt to establish a connection to remote  server
        return;
    }
    #elif defined SIM_KOMODO
    if (CAN_SIM_INITIALISE == iSpecial) {
        if (km < 0) {
            km = km_open(KOMODO_USB_PORT);                               // open a link to the Komodo via USB (channel 0 uses CAN A, channel 1 uses CAN B)
        }
        if (km >= 0) {
            int iCAN_speed = ((PCLK1/25)/((ptrCAN_control->CAN_BTR & CAN_BTR_BRP_MASK) + 1)); // assume that time quanta is 25
            if (iChannel != 0) {                                         // CAN B
                km_disable(km);
                km_acquire(km, (KM_FEATURE_CAN_B_CONFIG | KM_FEATURE_CAN_B_CONTROL | KM_FEATURE_CAN_B_LISTEN)); // acquire features
                km_timeout(km, KM_TIMEOUT_IMMEDIATE);
                km_can_bitrate(km, KM_CAN_CH_B, iCAN_speed);             // set bitrate
              //km_can_target_power(km, KM_CAN_CH_B, 1);                 // set target power
                km_enable(km);
              //km_can_target_power(km, KM_CAN_CH_B, 0);                 // disable target power
            }
            else {                                                       // CAN A
                km_disable(km);
                km_acquire(km, (KM_FEATURE_CAN_A_CONFIG | KM_FEATURE_CAN_A_CONTROL | KM_FEATURE_CAN_A_LISTEN)); // acquire features
                km_timeout(km, KM_TIMEOUT_IMMEDIATE);
                km_can_bitrate(km, KM_CAN_CH_A, iCAN_speed);             // set bitrate
              //km_can_target_power(km, KM_CAN_CH_A, 1);                 // set target power
                km_enable(km);
              //km_can_target_power(km, KM_CAN_CH_A, 0);                 // disable target power
            }
        }
    }
    #endif

    ptrMailbox += iBufferNumber;                                         // move to the mailbox to be used
    if (!(ptrMailbox->CAN_TIR & CAN_TIR_TXRQ)) {                         // if the tranmit request is not set we ignore it
        return;
    }

    // Transmission
    //
    if (ptrMailbox->CAN_TIR & CAN_TIR_TXRQ) {                            // transmission is requested
    #if defined SIM_KOMODO
        unsigned char ucData[8];
        int iResult;
        km_can_packet_t pkt;
        unsigned long arb_count = 0;
        // Send the CAN frame via remote simulator
        // 
        if (ptrMailbox->CAN_TIR & CAN_IR_IDE) {                          // extended identifier
            pkt.id = (ptrMailbox->CAN_TIR >> CAN_IR_EXTENDED_ID_SHIFT);
            pkt.id |= CAN_EXTENDED_ID;                                   // the address is to be handled as extended
            pkt.extend_addr = 1;
        }   
        else {
            pkt.id = (ptrMailbox->CAN_TIR >> CAN_IR_STANDARD_ID_SHIFT); // standard identifier
            pkt.extend_addr = 0;
        }
        iLastTxBuffer = iBufferNumber;
        ucTxDataLength = (unsigned char)(ptrMailbox->CAN_TDTR & CAN_TDTR_DLC_MASK);
        pkt.dlc = ucTxDataLength;
        ucData[0] = (unsigned char)ptrMailbox->CAN_TDLR;
        ucData[1] = (unsigned char)(ptrMailbox->CAN_TDLR >> 8);
        ucData[2] = (unsigned char)(ptrMailbox->CAN_TDLR >> 16);
        ucData[3] = (unsigned char)(ptrMailbox->CAN_TDLR >> 24);
        ucData[4] = (unsigned char)ptrMailbox->CAN_TDHR;
        ucData[5] = (unsigned char)(ptrMailbox->CAN_TDHR >> 8);
        ucData[6] = (unsigned char)(ptrMailbox->CAN_TDHR >> 16);
        ucData[7] = (unsigned char)(ptrMailbox->CAN_TDHR >> 24);
        if (ptrMailbox->CAN_TDTR & CAN_TDTR_TGT) {                       // if transmit global time is enabled the CAN time is inserted into the last two bytes of the frame
            ucData[6] = (unsigned char)(usCAN_time >> 8);
            ucData[7] = (unsigned char)(usCAN_time);
        }
        if (ptrMailbox->CAN_TIR & CAN_IR_RTR) {
            pkt.remote_req = 1;
            km_can_async_submit(km, iChannel, KM_CAN_ONE_SHOT, &pkt, 0, 0);  // send
        }
        else {
            pkt.remote_req = 0;
            km_can_async_submit(km, iChannel, KM_CAN_ONE_SHOT, &pkt, ucTxDataLength, (const unsigned char *)ucData);  // send
        }
        iResult = km_can_async_collect(km, 10, &arb_count);              // collect the result of the last transmission
        switch (iResult) {
        case KM_OK:
            switch (iBufferNumber) {
            case 0:
                ptrCAN_control->CAN_TSR |= (CAN_TSR_RQCP0 | CAN_TSR_TXOK0);
                break;
            case 1:
                ptrCAN_control->CAN_TSR |= (CAN_TSR_RQCP1 | CAN_TSR_TXOK1);
                break;
            case 2:
                ptrCAN_control->CAN_TSR |= (CAN_TSR_RQCP2 | CAN_TSR_TXOK2);
                break;
            }
            ptrMailbox->CAN_TIR &= ~CAN_TIR_TXRQ;
            if (ptrCAN_control->CAN_TSR & (CAN_TSR_RQCP0 | CAN_TSR_RQCP1 | CAN_TSR_RQCP2)) { // sucessful transmission
                ptrMailbox->CAN_TDTR = ((ptrMailbox->CAN_TDTR & ~CAN_TDTR_TIME_MASK) | (usCAN_time << 16)); // add a time stamp
                if (ptrCAN_control->CAN_IER & CAN_IER_TMEIE) {           // if tx interrupt is enabled
                    if (iChannel != 0) {
                        if (IRQ32_63_SER & (1 << (irq_CAN2_TX_ID - 32))) { // if CAN 2 Tx interrupt is not disabled
                            ptrVect->processor_interrupts.irq_CAN2_TX(); // call the interrupt handler
                        }
                    }
                    else {
                        if (IRQ0_31_SER & (1 << irq_CAN1_TX_ID)) {       // if CAN 1 Tx interrupt is not disabled
                            ptrVect->processor_interrupts.irq_CAN1_TX(); // call the interrupt handler
                        }
                    }
                }
            }
            break;
        default:                                                         // transmission error
            switch (iBufferNumber) {
            case 0:
                ptrCAN_control->CAN_TSR |= (CAN_TSR_TERR0);
                break;
            case 1:
                ptrCAN_control->CAN_TSR |= (CAN_TSR_TERR1);
                break;
            case 2:
                ptrCAN_control->CAN_TSR |= (CAN_TSR_TERR2);
                break;
            }
            if (ptrCAN_control->CAN_TSR & (CAN_TSR_TERR0 | CAN_TSR_TERR1 | CAN_TSR_TERR2)) { // failed transmission
                if ((ptrCAN_control->CAN_IER & CAN_IER_EPVIE) &&  (ptrCAN_control->CAN_IER & CAN_IER_ERRIE)) { // if passive error interrupt enabled
                    if (iChannel != 0) {
                        if (IRQ64_95_SER & (1 << (irq_CAN2_SCE_ID - 64))) { // if CAN 2 Tx interrupt is not disabled
                            ptrVect->processor_interrupts.irq_CAN2_SCE();// call the interrupt handler
                        }
                    }
                    else {
                        if (IRQ0_31_SER & (1 << irq_CAN1_SCE_ID)) {      // if CAN 1 Tx interrupt is not disabled
                            ptrVect->processor_interrupts.irq_CAN1_SCE();// call the interrupt handler
                        }
                    }
                }
            }
            break;
        }
    #endif
    }
}
#endif

#if 1 //defined RUN_IN_FREE_RTOS
extern unsigned long *fnGetRegisterAddress(unsigned long ulAddress)
{
    ulAddress -= 0xe000e000;
    ulAddress += (unsigned long)CORTEX_M3_BLOCK;
    return (unsigned long *)ulAddress;
}

extern void fnSetReg(int iRef, unsigned long ulValue)
{
    switch (iRef) {
    case 0:
        STM32.CORTEX_M3_REGS.ulR0 = ulValue;
        break;
    case 14:
        STM32.CORTEX_M3_REGS.ulPSP = ulValue;
        break;
    case 15:
        STM32.CORTEX_M3_REGS.ulMSP = ulValue;
        break;
    case 19:
        STM32.CORTEX_M3_REGS.ulPRIMASK = ulValue;
        break;
    case 20:
        STM32.CORTEX_M3_REGS.ulFAULTMASK = ulValue;
        break;
    case 22:
        STM32.CORTEX_M3_REGS.ulCONTROL = ulValue;
        break;
    }
}
#endif

// Prepare a string to be displayed in the simulator status bar          // {8}
//
extern void fnUpdateOperatingDetails(void)
{
    #if !defined NO_STATUS_BAR
    extern void fnPostOperatingDetails(char *ptrDetails);
    unsigned long ulHCLK;
    unsigned long ulAPB1;
    #if defined RCC_CFGR_PPRE2_HCLK_DIV2
    unsigned long ulAPB2;
    #endif
    CHAR cOperatingDetails[256];
    CHAR *ptrBuffer = cOperatingDetails;
    ptrBuffer = uStrcpy(ptrBuffer, "FLASH = ");
    ptrBuffer = fnBufferDec((SIZE_OF_FLASH/1024), 0, ptrBuffer);
    ptrBuffer = uStrcpy(ptrBuffer, "k, SRAM = ");
    ptrBuffer = fnBufferDec((SIZE_OF_RAM/1024), 0, ptrBuffer);
    ptrBuffer = uStrcpy(ptrBuffer, "k, HCLK = ");
    ulHCLK = (PLL_OUTPUT_FREQ >> ((RCC_CFGR & RCC_CFGR_HPRE_SYSCLK_DIV512) >> 4)); // HCLK according to register setting
    if ((RCC_CFGR & RCC_CFGR_PPRE1_HCLK_DIV2) != 0) {                    // if divide enabled
        #if defined _STM32L432 || defined _STM32L0x1
        ulAPB1 = (ulHCLK >> (((RCC_CFGR >> 8) & 0x03) + 1));             // APB1 clock according to register settings
        #else
        ulAPB1 = (ulHCLK >> (((RCC_CFGR >> 10) & 0x03) + 1));            // APB1 clock according to register settings
        #endif
    }
    else {
        ulAPB1 = ulHCLK;
    }
    #if defined RCC_CFGR_PPRE2_HCLK_DIV2
    if ((RCC_CFGR & RCC_CFGR_PPRE2_HCLK_DIV2) != 0) {                    // if divide enabled
        #if defined _STM32L432 || defined _STM32L0x1
        ulAPB2 = (ulHCLK >> (((RCC_CFGR >> 11) & 0x03) + 1));            // APB2 clock according to register settings
        #else
        ulAPB2 = (ulHCLK >> (((RCC_CFGR >> 13) & 0x03) + 1));            // APB2 clock according to register settings
        #endif
    }
    else {
        ulAPB2 = ulHCLK;
    }
    #endif
    ptrBuffer = fnBufferDec(ulHCLK, 0, ptrBuffer);
    #if defined RCC_CFGR_PPRE2_HCLK_DIV2
    ptrBuffer = uStrcpy(ptrBuffer, ", APB1 = ");
    ptrBuffer = fnBufferDec(ulAPB1, 0, ptrBuffer);
    ptrBuffer = uStrcpy(ptrBuffer, ", APB2 = ");
    ptrBuffer = fnBufferDec(ulAPB2, 0, ptrBuffer);
    #else
    ptrBuffer = uStrcpy(ptrBuffer, ", APB = ");
    ptrBuffer = fnBufferDec(ulAPB1, 0, ptrBuffer);
    #endif
    fnPostOperatingDetails(cOperatingDetails);
    #endif
}
#endif



